#### ElementMulticategoryFilter Constructor (ICollection(ElementId))

---

|  |
| --- |
| ElementMulticategoryFilter Class   See Also |

Constructs a new instance of a filter to find elements whose category matches any of a given set of categories.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public ElementMulticategoryFilter( 	ICollection<ElementId> categoryIds ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	categoryIds As ICollection(Of ElementId) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ElementMulticategoryFilter( 	ICollection<ElementId^>^ categoryIds ) ``` |

#### Parameters

categoryIds
:   Type:  System.Collections.Generic ICollection   ElementId
     The category ids to match.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | One or more categories was not valid for filtering. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ElementMulticategoryFilter Class

ElementMulticategoryFilter Overload

Autodesk.Revit.DB Namespace

#### Origin Property

---

|  |
| --- |
| CylindricalSurface Class   See Also |

Center of the circle that defines the base of the cylinder. This is the origin of the local coordinate system associated with this cylinder.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public XYZ Origin { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Origin As XYZ 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ Origin { 	XYZ^ get (); } ``` |

# See Also

CylindricalSurface Class

Autodesk.Revit.DB Namespace

#### DrawSplitLine Method

---

|  |
| --- |
| SlabShapeEditor Class   See Also |

Draws a split line on the corresponding slab, roof or floor.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public SlabShapeCreaseArray DrawSplitLine( 	SlabShapeVertex startVertex, 	SlabShapeVertex endVertex ) ``` |

| Visual Basic |
| --- |
| ``` Public Function DrawSplitLine ( _ 	startVertex As SlabShapeVertex, _ 	endVertex As SlabShapeVertex _ ) As SlabShapeCreaseArray ``` |

| Visual C++ |
| --- |
| ``` public: SlabShapeCreaseArray^ DrawSplitLine( 	SlabShapeVertex^ startVertex,  	SlabShapeVertex^ endVertex ) ``` |

#### Parameters

startVertex
:   Type:  Autodesk.Revit.DB SlabShapeVertex
     The vertex to start the split line.

endVertex
:   Type:  Autodesk.Revit.DB SlabShapeVertex
     The vertex to end the split line.

#### Return Value

The newly created creases.

# Remarks

Drawing a split line may result in multiple creases, for example when the line crosses existing creases or boundary edges.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the input vertex is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the input vertex is invalid. |

# See Also

SlabShapeEditor Class

Autodesk.Revit.DB Namespace

#### JournalingMode Enumeration

---

|  |
| --- |
| See Also |

All journaling modes supported by Revit external commands.

**Namespace:**   Autodesk.Revit.Attributes
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public enum JournalingMode ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration JournalingMode ``` |

| Visual C++ |
| --- |
| ``` public enum class JournalingMode ``` |

# Members

| Member name | Description |
| --- | --- |
| UsingCommandData | Uses the "StringStringMap" supplied in the command data. Hides all Revit journal entries in between the external command invocation and the StringStringMap entry. Commands which invoke the Revit UI for selection or for responses to task dialogs may not replay correctly. |
| NoCommandData | Does not write contents of the ExternalCommandData.Data map to the Revit journal. But does allow Revit API calls to write to the journal as needed. This option should allow commands which invoke the Revit UI for selection or for responses to task dialogs to replay correctly. |

# See Also

Autodesk.Revit.Attributes Namespace

#### TextureRealWorldScaleX Property

---

|  |
| --- |
| BumpMap Class   See Also |

The property labeled "Size X" from the "BumpMap" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TextureRealWorldScaleX { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextureRealWorldScaleX As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TextureRealWorldScaleX { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDistance" with a minimum of "0.01".

# See Also

BumpMap Class

Autodesk.Revit.DB.Visual Namespace

#### Dispose Method

---

|  |
| --- |
| DirectShapeLibrary Class   See Also |

Releases all resources used by the  DirectShapeLibrary

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

DirectShapeLibrary Class

Autodesk.Revit.DB Namespace

#### ConnectPipePlaceholdersAtElbow Method (Document, ElementId, ElementId)

---

|  |
| --- |
| PlumbingUtils Class   See Also |

Connects placeholders that looks like elbow connection.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static bool ConnectPipePlaceholdersAtElbow( 	Document document, 	ElementId placeholder1Id, 	ElementId placeholder2Id ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function ConnectPipePlaceholdersAtElbow ( _ 	document As Document, _ 	placeholder1Id As ElementId, _ 	placeholder2Id As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool ConnectPipePlaceholdersAtElbow( 	Document^ document,  	ElementId^ placeholder1Id,  	ElementId^ placeholder2Id ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

placeholder1Id
:   Type:  Autodesk.Revit.DB ElementId
     The element Id of pipe placeholder.

placeholder2Id
:   Type:  Autodesk.Revit.DB ElementId
     The element Id of pipe placeholder.

#### Return Value

True if connection succeeds, false otherwise.

# Remarks

There must be a physical end connection of placeholders. If connection fails, the placeholders cannot be physically connected.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The element id placeholder1Id is not pipe placeholder. -or- The element id placeholder2Id is not pipe placeholder. -or- The elements belong to different types of system. -or- The curve placeholder1Id and placeholder2Id are not physically connected. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PlumbingUtils Class

ConnectPipePlaceholdersAtElbow Overload

Autodesk.Revit.DB.Plumbing Namespace

#### GetProfileCurve Method

---

|  |
| --- |
| RevolvedSurface Class   See Also |

Returns a copy of the profile curve expressed in the surface's coordinate system.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public Curve GetProfileCurve() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetProfileCurve As Curve ``` |

| Visual C++ |
| --- |
| ``` public: Curve^ GetProfileCurve() ``` |

#### Return Value

A copy of the profile curve.

# See Also

RevolvedSurface Class

Autodesk.Revit.DB Namespace

#### GenericBumpMap Property

---

|  |
| --- |
| Generic Class   See Also |

The property labeled "Bump" from the "Generic" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string GenericBumpMap { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GenericBumpMap As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ GenericBumpMap { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

# See Also

Generic Class

Autodesk.Revit.DB.Visual Namespace

#### Create Method (Document, Element, IList(Curve), Boolean, ElementId, ElementId, ElementId, ElementId)

---

|  |
| --- |
| PathReinforcement Class   Example   See Also |

Creates a new PathReinforcement object from an array of curves. The newly created object will use a default Rebar Shape.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public static PathReinforcement Create( 	Document document, 	Element hostElement, 	IList<Curve> curveArray, 	bool flip, 	ElementId pathReinforcementTypeId, 	ElementId rebarBarTypeId, 	ElementId startRebarHookTypeId, 	ElementId endRebarHookTypeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	hostElement As Element, _ 	curveArray As IList(Of Curve), _ 	flip As Boolean, _ 	pathReinforcementTypeId As ElementId, _ 	rebarBarTypeId As ElementId, _ 	startRebarHookTypeId As ElementId, _ 	endRebarHookTypeId As ElementId _ ) As PathReinforcement ``` |

| Visual C++ |
| --- |
| ``` public: static PathReinforcement^ Create( 	Document^ document,  	Element^ hostElement,  	IList<Curve^>^ curveArray,  	bool flip,  	ElementId^ pathReinforcementTypeId,  	ElementId^ rebarBarTypeId,  	ElementId^ startRebarHookTypeId,  	ElementId^ endRebarHookTypeId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

hostElement
:   Type:  Autodesk.Revit.DB Element
     The element that will host the PathReinforcement. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.

curveArray
:   Type:  System.Collections.Generic IList   Curve
     An array of curves that will define the outline of the PathReinforcement.

flip
:   Type:  System Boolean
     A flag controlling the bars relative to the curves.

pathReinforcementTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the PathReinforcementType.

rebarBarTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the RebarBarType.

startRebarHookTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the RebarHookType for the start of the bar. If this parameter is InvalidElementId, it means to create a rebar with no start hook.

endRebarHookTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the RebarHookType for the end of the bar. If this parameter is InvalidElementId, it means to create a rebar with no end hook.

#### Return Value

The newly created PathReinforcement.

# Remarks

The method sets Rebar Shape of primary bars only.

# Examples

 Copy  C#

```
PathReinforcement CreatePathReinforcement(Autodesk.Revit.DB.Document document, Wall wall)
{
    // Create a geometry line in the selected wall as the path
    List<Curve> curves = new List<Curve>();
    LocationCurve location = wall.Location as LocationCurve;
    XYZ start = location.Curve.GetEndPoint(0);
    XYZ end = location.Curve.GetEndPoint(1);
    curves.Add(Line.CreateBound(start, end));

    // Obtain the default types
    ElementId defaultRebarBarTypeId = document.GetDefaultElementTypeId(ElementTypeGroup.RebarBarType);
    ElementId defaultPathReinforcementTypeId = document.GetDefaultElementTypeId(ElementTypeGroup.PathReinforcementType);
    ElementId defaultHookTypeId = ElementId.InvalidElementId;

    // Begin to create the path reinforcement
    PathReinforcement rein = PathReinforcement.Create(document, wall, curves, true, defaultPathReinforcementTypeId, defaultRebarBarTypeId, defaultHookTypeId, defaultHookTypeId);
    if (null == rein)
    {
        throw new Exception("Create path reinforcement failed.");
    }

    // Give the user some information
    TaskDialog.Show("Revit","Create path reinforcement succeed.");

    return rein;
}
```

 Copy  VB.NET

```
Private Function CreatePathReinforcement(document As Autodesk.Revit.DB.Document, wall As Wall) As PathReinforcement
    ' Create a geometry line in the selected wall as the path
    Dim curves As New List(Of Curve)()
    Dim location As LocationCurve = TryCast(wall.Location, LocationCurve)
    Dim start As XYZ = location.Curve.GetEndPoint(0)
    Dim [end] As XYZ = location.Curve.GetEndPoint(1)
    curves.Add(Line.CreateBound(start, [end]))

    ' Obtain the default types
    Dim defaultRebarBarTypeId As ElementId = document.GetDefaultElementTypeId(ElementTypeGroup.RebarBarType)
    Dim defaultPathReinforcementTypeId As ElementId = document.GetDefaultElementTypeId(ElementTypeGroup.PathReinforcementType)
    Dim defaultHookTypeId As ElementId = ElementId.InvalidElementId

    ' Begin to create the path reinforcement
    Dim rein As PathReinforcement = PathReinforcement.Create(document, wall, curves, True, defaultPathReinforcementTypeId, defaultRebarBarTypeId, _
        defaultHookTypeId, defaultHookTypeId)
    If rein Is Nothing Then
        Throw New Exception("Create path reinforcement failed.")
    End If

    ' Give the user some information
    TaskDialog.Show("Revit", "Create path reinforcement succeed.")

    Return rein
End Function
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The input curveArray is empty. -or- The input curveArray contains at least one helical curve and is not supported for this operation. -or- The element hostElement was not found in the given document. -or- the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet. -or- curves in curveArray are not continuous and open. -or- pathReinforcementTypeId should refer to an Path Reinforcement Type element. -or- rebarBarTypeId should refer to an RebarBarType element. -or- startRebarHookTypeId should be invalid or refer to an RebarHookType element. -or- endRebarHookTypeId should be invalid or refer to an RebarHookType element. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions ForbiddenForDynamicUpdateException | This method may not be called during dynamic update. |

# See Also

PathReinforcement Class

Create Overload

Autodesk.Revit.DB.Structure Namespace

#### SheetAssemblyDescription Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Assembly: Description"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SheetAssemblyDescription { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SheetAssemblyDescription As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SheetAssemblyDescription { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SlabShapeCreases Property

---

|  |
| --- |
| SlabShapeEditor Class   See Also |

All of the creases that can be edited.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public SlabShapeCreaseArray SlabShapeCreases { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property SlabShapeCreases As SlabShapeCreaseArray 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property SlabShapeCreaseArray^ SlabShapeCreases { 	SlabShapeCreaseArray^ get (); } ``` |

# See Also

SlabShapeEditor Class

Autodesk.Revit.DB Namespace

#### NewSlabEdge Method (SlabEdgeType, ReferenceArray)

---

|  |
| --- |
| Document Class   See Also |

Creates a slab edge along a reference array.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public SlabEdge NewSlabEdge( 	SlabEdgeType SlabEdgeType, 	ReferenceArray references ) ``` |

| Visual Basic |
| --- |
| ``` Public Function NewSlabEdge ( _ 	SlabEdgeType As SlabEdgeType, _ 	references As ReferenceArray _ ) As SlabEdge ``` |

| Visual C++ |
| --- |
| ``` public: SlabEdge^ NewSlabEdge( 	SlabEdgeType^ SlabEdgeType,  	ReferenceArray^ references ) ``` |

#### Parameters

SlabEdgeType
:   Type:  Autodesk.Revit.DB SlabEdgeType
     The type of the slab edge to create

references
:   Type:  Autodesk.Revit.DB ReferenceArray
     An array of planar lines and arcs that represents the place where you want to place the slab edge.

#### Return Value

If successful a new slab edge object within the project, otherwise    a null reference (  Nothing  in Visual Basic)  .

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown if the slab edge type does not exist in the given document. |

# See Also

Document Class

NewSlabEdge Overload

Autodesk.Revit.Creation Namespace

#### GetLinePatternId Method

---

|  |
| --- |
| Category Class   See Also |

Gets the line pattern id associated with this category for the given graphics style type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public ElementId GetLinePatternId( 	GraphicsStyleType graphicsStyleType ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetLinePatternId ( _ 	graphicsStyleType As GraphicsStyleType _ ) As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: ElementId^ GetLinePatternId( 	GraphicsStyleType graphicsStyleType ) ``` |

#### Parameters

graphicsStyleType
:   Type:  Autodesk.Revit.DB GraphicsStyleType
     The type of graphics style.

#### Return Value

Returns the line pattern id associated with this category for the given graphics style type.

# Remarks

* The line pattern id will be one of the following:
* A negative value (representing a built-in line pattern)
* The id of a LinePatternElement
* InvalidElementId, indicating that this category does not have a stored line pattern id for this graphics style type.

# See Also

Category Class

Autodesk.Revit.DB Namespace

#### GetCellText Method

---

|  |
| --- |
| TableView Class   See Also |

Gets the cell's text based on its type

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public string GetCellText( 	SectionType sectionType, 	int row, 	int column ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetCellText ( _ 	sectionType As SectionType, _ 	row As Integer, _ 	column As Integer _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: String^ GetCellText( 	SectionType sectionType,  	int row,  	int column ) ``` |

#### Parameters

sectionType
:   Type:  Autodesk.Revit.DB SectionType
     The requested section type

row
:   Type:  System Int32
     Row Number in the Section

column
:   Type:  System Int32
     Column Number in the Section

#### Return Value

The text for the given cell

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The sectionType is not a valid type for this view. |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | The given row number row is invalid. -or- The given column number column is invalid. -or- A value passed for an enumeration argument is not a member of that enumeration |

# See Also

TableView Class

Autodesk.Revit.DB Namespace

#### WiringType Enumeration

---

|  |
| --- |
| See Also |

An enumerated type to list all wiring types.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum WiringType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration WiringType ``` |

| Visual C++ |
| --- |
| ``` public enum class WiringType ``` |

# Members

| Member name | Description |
| --- | --- |
| Arc | Arc wiring is used to indicate wiring that is concealed within walls, ceilings, or floors. |
| Chamfer | Chamfered wiring can be used to indicate wiring that is exposed. |

# See Also

Autodesk.Revit.DB.Electrical Namespace

#### SetLeaderEnd Method

---

|  |
| --- |
| IndependentTag Class   See Also |

Set the end position of the tag's leader that points to specified reference.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public void SetLeaderEnd( 	Reference referenceTagged, 	XYZ pointEnd ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetLeaderEnd ( _ 	referenceTagged As Reference, _ 	pointEnd As XYZ _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetLeaderEnd( 	Reference^ referenceTagged,  	XYZ^ pointEnd ) ``` |

#### Parameters

referenceTagged
:   Type:  Autodesk.Revit.DB Reference
     The reference which is tagged.

pointEnd
:   Type:  Autodesk.Revit.DB XYZ
     Point representing the end position of tag's leader

# Remarks

Tags with attached leaders or no leaders do not support leader ends.  LeaderEndCondition  for the tag's leader condition.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | There is no leader end because the tag does not use a free end leader or the leader is not visible. -or- The specified reference is not currently tagged. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

IndependentTag Class

Autodesk.Revit.DB Namespace

#### GetDefaultNameForSchedule Method (Document, ElementId)

---

|  |
| --- |
| ViewSchedule Class   See Also |

Gets the default view name that will be used when creating a regular schedule.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static string GetDefaultNameForSchedule( 	Document document, 	ElementId categoryId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetDefaultNameForSchedule ( _ 	document As Document, _ 	categoryId As ElementId _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: static String^ GetDefaultNameForSchedule( 	Document^ document,  	ElementId^ categoryId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document to which the new schedule will be added.

categoryId
:   Type:  Autodesk.Revit.DB ElementId
     The ID of the category whose elements will be included in the schedule, or InvalidElementId for a multi-category schedule.

#### Return Value

The default view name.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | document is not a project document. -or- categoryId is not a valid category for a regular schedule. -or- The Areas category was specified but an area scheme ID was not provided. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ViewSchedule Class

GetDefaultNameForSchedule Overload

Autodesk.Revit.DB Namespace

#### BuildEntries Method

---

|  |
| --- |
| KeyBasedTreeEntriesLoadContent Class   See Also |

Builds a KeyBasedTreeEntries object.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public void BuildEntries() ``` |

| Visual Basic |
| --- |
| ``` Public Sub BuildEntries ``` |

| Visual C++ |
| --- |
| ``` public: void BuildEntries() ``` |

# Remarks

This method will take all the entries that have been added, create a KeyBasedTreeEntries object out of these entries, and also record possible errors that occurred while constructing this KeyBasedTreeEntries object. After this function is called, no more entries can be added. And repeated calling of this function is not allowed either.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | The KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object is built already. Adding more KeyBasedTreeEntries as well as repeated building, is not supported. |

# See Also

KeyBasedTreeEntriesLoadContent Class

Autodesk.Revit.DB Namespace

#### Print Method (ViewSet, View, Boolean)

---

|  |
| --- |
| Document Class   See Also |

Prints a set of views with a specified view template and default print settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Print( 	ViewSet views, 	View viewTemplate, 	bool useCurrentPrintSettings ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub Print ( _ 	views As ViewSet, _ 	viewTemplate As View, _ 	useCurrentPrintSettings As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void Print( 	ViewSet^ views,  	View^ viewTemplate,  	bool useCurrentPrintSettings ) ``` |

#### Parameters

views
:   Type:  Autodesk.Revit.DB ViewSet
     The set of views which need to be printed.

viewTemplate
:   Type:  Autodesk.Revit.DB View
     The view template which apply to the set of views.

useCurrentPrintSettings
:   Type:  System Boolean
     If true, print the view with the current print setting, otherwise with the print setting of the document of the view.

# Remarks

If one view in the set can not be printed successfully then an exception will be thrown.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when printing is not allowed in the current application mode. Or when at least one view from the view set is not a printable view. |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the view set to be printed is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the view set contains a    a null reference (  Nothing  in Visual Basic)  element. |
| Autodesk.Revit.Exceptions ApplicationException | Thrown when at least one view from the view set could not be printed. |
| Autodesk.Revit.Exceptions OperationCanceledException | Thrown when print is cancelled by event handler. |

# See Also

Document Class

Print Overload

Autodesk.Revit.DB Namespace

#### Profile Property

---

|  |
| --- |
| BeamSystem Class   See Also |

Retrieve or set the profile of the BeamSystem.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public CurveArray Profile { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Profile As CurveArray 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property CurveArray^ Profile { 	CurveArray^ get (); 	void set (CurveArray^ value); } ``` |

# See Also

BeamSystem Class

Autodesk.Revit.DB Namespace

#### CannotCreateGutterError Property

---

|  |
| --- |
| BuiltInFailures CreationFailures Class   See Also |

Could not create Gutter. [Description]

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCreateGutterError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCreateGutterError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCreateGutterError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CreationFailures Class

Autodesk.Revit.DB Namespace

#### PlumbingFixturesSupplyPipe Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Supply Pipe"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PlumbingFixturesSupplyPipe { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PlumbingFixturesSupplyPipe As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PlumbingFixturesSupplyPipe { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StructuralAttachmentTopReferencedend Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Top Attachment Referenced End"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralAttachmentTopReferencedend { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralAttachmentTopReferencedend As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralAttachmentTopReferencedend { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetMatchingPreset Method

---

|  |
| --- |
| SunAndShadowSettings Class   See Also |

Finds the name of the 'per-document' SunAndShadowSettings that matches the properties of this per-view element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public string GetMatchingPreset() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetMatchingPreset As String ``` |

| Visual C++ |
| --- |
| ``` public: String^ GetMatchingPreset() ``` |

#### Return Value

Name of the per-document SunAndShadowSettings that matches the view specific element.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The SunAndShadowSettings is not view-specific. |

# See Also

SunAndShadowSettings Class

Autodesk.Revit.DB Namespace

#### FailedDowngradeCrossToElbow Property

---

|  |
| --- |
| BuiltInFailures AutoRouteFailures Class   See Also |

Failed to downgrade tee type to elbow type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FailedDowngradeCrossToElbow { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FailedDowngradeCrossToElbow As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FailedDowngradeCrossToElbow { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures AutoRouteFailures Class

Autodesk.Revit.DB Namespace

#### GenericRepoHelperService Property

---

|  |
| --- |
| ExternalServices BuiltInExternalServices Class   See Also |

Unique service id.

**Namespace:**   Autodesk.Revit.DB.ExternalService
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ExternalServiceId GenericRepoHelperService { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GenericRepoHelperService As ExternalServiceId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ExternalServiceId^ GenericRepoHelperService { 	ExternalServiceId^ get (); } ``` |

# See Also

ExternalServices BuiltInExternalServices Class

Autodesk.Revit.DB.ExternalService Namespace

#### View Class

---

|  |
| --- |
| Members   Example   See Also |

Base class for all types of views in Autodesk Revit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public class View : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class View _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class View : public Element ``` |

# Remarks

A view can display an image produced from a Revit model. Views can be graphical (e.g. plans, elevations, or 3D views) or textual (e.g. schedules). Views keep track of Elements that can be seen in them.

# Examples

 Copy  C#

```
private void Getinfo_View(Autodesk.Revit.DB.View view)
{
    string message = "View: ";

    //get the name of the view
    message += "\nView name: " + view.Name;

    //The crop box sets display bounds of the view
    BoundingBoxXYZ cropBox = view.CropBox;
    XYZ max = cropBox.Max; //Maximum coordinates (upper-right-front corner of the box).
    XYZ min = cropBox.Min; //Minimum coordinates (lower-left-rear corner of the box).
    message += "\nCrop Box: ";
    message += "\nMaximum coordinates: (" + max.X + ", " + max.Y + ", " + max.Z + ")";
    message += "\nMinimum coordinates: (" + min.X + ", " + min.Y + ", " + min.Z + ")";

   //get the origin of the screen
    XYZ origin = view.Origin;
    message += "\nOrigin: (" + origin.X + ", " + origin.Y + ", " + origin.Z + ")";

    //The bounds of the view in paper space (in inches).
    BoundingBoxUV outline = view.Outline;
    UV maxUv = outline.Max; //Maximum coordinates (upper-right corner of the box).
    UV minUv = outline.Min; //Minimum coordinates (lower-left corner of the box).
    message += "\nOutline: ";
    message += "\nMaximum coordinates: (" + maxUv.U + ", " + maxUv.V + ")";
    message += "\nMinimum coordinates: (" + minUv.U + ", " + minUv.V + ")";

    //The direction towards the right side of the screen
    XYZ rightDirection = view.RightDirection;
    message += "\nRight direction: (" + rightDirection.X + ", " +
                   rightDirection.Y + ", " + rightDirection.Z + ")";

    //The direction towards the top of the screen
    XYZ upDirection = view.UpDirection;
    message += "\nUp direction: (" + upDirection.X + ", " +
                   upDirection.Y + ", " + upDirection.Z + ")";

    //The direction towards the viewer
    XYZ viewDirection = view.ViewDirection;
    message += "\nView direction: (" + viewDirection.X + ", " +
                   viewDirection.Y + ", " + viewDirection.Z + ")";

    //The scale of the view
    message += "\nScale: " + view.Scale;
    // Scale is meaningless for Schedules
    if (view.ViewType != ViewType.Schedule)
    {
        int testScale = 5;
        //set the scale of the view
        view.Scale = testScale;
        message += "\nScale after set: " + view.Scale;
    }

    TaskDialog.Show("Revit",message);
}
```

 Copy  VB.NET

```
Private Sub Getinfo_View(view As Autodesk.Revit.DB.View)
    Dim message As String = "View: "

    'get the name of the view
    message += vbLf & "View name: " + view.Name

    'The crop box sets display bounds of the view
    Dim cropBox As BoundingBoxXYZ = view.CropBox
    Dim max As XYZ = cropBox.Max
    'Maximum coordinates (upper-right-front corner of the box).
    Dim min As XYZ = cropBox.Min
    'Minimum coordinates (lower-left-rear corner of the box).
    message += vbLf & "Crop Box: "
    message += vbLf & "Maximum coordinates: (" + max.X + ", " + max.Y + ", " + max.Z + ")"
    message += vbLf & "Minimum coordinates: (" + min.X + ", " + min.Y + ", " + min.Z + ")"

    'get the origin of the screen
    Dim origin As XYZ = view.Origin
    message += vbLf & "Origin: (" + origin.X + ", " + origin.Y + ", " + origin.Z + ")"

    'The bounds of the view in paper space (in inches).
    Dim outline As BoundingBoxUV = view.Outline
    Dim maxUv As UV = outline.Max
    'Maximum coordinates (upper-right corner of the box).
    Dim minUv As UV = outline.Min
    'Minimum coordinates (lower-left corner of the box).
    message += vbLf & "Outline: "
    message += vbLf & "Maximum coordinates: (" + maxUv.U + ", " + maxUv.V + ")"
    message += vbLf & "Minimum coordinates: (" + minUv.U + ", " + minUv.V + ")"

    'The direction towards the right side of the screen
    Dim rightDirection As XYZ = view.RightDirection
    message += vbLf & "Right direction: (" + rightDirection.X + ", " + rightDirection.Y + ", " + rightDirection.Z + ")"

    'The direction towards the top of the screen
    Dim upDirection As XYZ = view.UpDirection
    message += vbLf & "Up direction: (" + upDirection.X + ", " + upDirection.Y + ", " + upDirection.Z + ")"

    'The direction towards the viewer
    Dim viewDirection As XYZ = view.ViewDirection
    message += vbLf & "View direction: (" + viewDirection.X + ", " + viewDirection.Y + ", " + viewDirection.Z + ")"

    'The scale of the view
    message += vbLf & "Scale: " + view.Scale
    ' Scale is meaningless for Schedules
    If view.ViewType <> ViewType.Schedule Then
        Dim testScale As Integer = 5
        'set the scale of the view
        view.Scale = testScale
        message += vbLf & "Scale after set: " + view.Scale
    End If

    TaskDialog.Show("Revit", message)
End Sub
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB View
  Autodesk.Revit.DB.Analysis ViewSystemsAnalysisReport
  Autodesk.Revit.DB TableView
  Autodesk.Revit.DB View3D
  Autodesk.Revit.DB ViewDrafting
  Autodesk.Revit.DB ViewPlan
  Autodesk.Revit.DB ViewSection
  Autodesk.Revit.DB ViewSheet

# See Also

View Members

Autodesk.Revit.DB Namespace

#### ShowArrowheadToCutMark Property

---

|  |
| --- |
| StairsPathType Class   See Also |

True if the stairs path arrowhead should be shown to the cutmark, false if the arrow head is not shown.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool ShowArrowheadToCutMark { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ShowArrowheadToCutMark As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool ShowArrowheadToCutMark { 	bool get (); 	void set (bool value); } ``` |

# See Also

StairsPathType Class

Autodesk.Revit.DB.Architecture Namespace

#### ElementsBelongToOtherSystem Property

---

|  |
| --- |
| BuiltInFailures SystemsFailures Class   See Also |

You have selected elements that are already part of other Systems that have assigned Equipment. The elements you selected cannot be added to this System.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ElementsBelongToOtherSystem { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ElementsBelongToOtherSystem As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ElementsBelongToOtherSystem { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SystemsFailures Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| ATFBaseExportOptions Class   See Also |

Releases all resources used by the  ATFBaseExportOptions

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

ATFBaseExportOptions Class

Autodesk.Revit.DB Namespace

#### ElementsAlreadyDisplacedInView Property

---

|  |
| --- |
| BuiltInFailures DisplacementElementFailures Class   See Also |

You cannot copy a displacement set into a view if one or several of its elements already belong to another displacement set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ElementsAlreadyDisplacedInView { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ElementsAlreadyDisplacedInView As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ElementsAlreadyDisplacedInView { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DisplacementElementFailures Class

Autodesk.Revit.DB Namespace

#### BoundingBoxIsInsideFilter Constructor (Outline, Double, Boolean)

---

|  |
| --- |
| BoundingBoxIsInsideFilter Class   See Also |

Constructs a new instance of a filter to match elements with a bounding box is contained by the given Outline, with the option to invert the filter and match all elements with a bounding box that are not contained by the given Outline.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public BoundingBoxIsInsideFilter( 	Outline outline, 	double tolerance, 	bool inverted ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	outline As Outline, _ 	tolerance As Double, _ 	inverted As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: BoundingBoxIsInsideFilter( 	Outline^ outline,  	double tolerance,  	bool inverted ) ``` |

#### Parameters

outline
:   Type:  Autodesk.Revit.DB Outline
     The Outline used to find elements with a bounding box that are contained by it.

tolerance
:   Type:  System Double
     The tolerance value to use instead of zero. See the tolerance property for details.

inverted
:   Type:  System Boolean
     True if the filter should be inverted and match all elements with a bounding box that are not contained by the given Outline.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | outline is an empty Outline. -or- The given value for tolerance is not finite -or- The given value for tolerance is not a number |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

BoundingBoxIsInsideFilter Class

BoundingBoxIsInsideFilter Overload

Autodesk.Revit.DB Namespace

#### Btu Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol Btu, indicating unit British thermal units.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Btu { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Btu As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Btu { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### MaximumSize Property

---

|  |
| --- |
| PrimarySizeCriterion Class   See Also |

The maximum size of this criterion.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double MaximumSize { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property MaximumSize As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double MaximumSize { 	double get (); 	void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also

PrimarySizeCriterion Class

Autodesk.Revit.DB Namespace

#### GetUV Method

---

|  |
| --- |
| PolymeshTopology Class   See Also |

Returns one UV coordinate at the given index.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public UV GetUV( 	int idx ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetUV ( _ 	idx As Integer _ ) As UV ``` |

| Visual C++ |
| --- |
| ``` public: UV^ GetUV( 	int idx ) ``` |

#### Parameters

idx
:   Type:  System Int32
     A zero-based index of a UV coordinate

#### Return Value

UV coordinates at the given index

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given value is not a valid index of a UV coordinate of the polymesh. A valid valure is not negative and is smaller than the number of UV coordinates in the polymesh. |

# See Also

PolymeshTopology Class

Autodesk.Revit.DB Namespace

#### V1 Property

---

|  |
| --- |
| PolymeshFacet Class   See Also |

The first vertex of the facet

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public int V1 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property V1 As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int V1 { 	int get (); } ``` |

#### Field Value

An index of a vertex of a polymesh.

# See Also

PolymeshFacet Class

Autodesk.Revit.DB Namespace

#### BadRailingsError Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Can't create Railings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId BadRailingsError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BadRailingsError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ BadRailingsError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### IsVertexPointValid Method

---

|  |
| --- |
| Wire Class   See Also |

Checks if the given vertex point can be added to this wire.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public bool IsVertexPointValid( 	XYZ vertexPoint ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsVertexPointValid ( _ 	vertexPoint As XYZ _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsVertexPointValid( 	XYZ^ vertexPoint ) ``` |

#### Parameters

vertexPoint
:   Type:  Autodesk.Revit.DB XYZ
     The vertex point.

#### Return Value

True if the vertex point can be added, false if the point cannot be added because there is already a vertex at this position on the view plane (within tolerance).

# Remarks

Vertices are projected to the view plane for comparison.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

Wire Class

Autodesk.Revit.DB.Electrical Namespace

#### SetLayoutMinimumSpacing Method

---

|  |
| --- |
| SpacingRule Class   See Also |

Set the Layout property to MinimumSpacing.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetLayoutMinimumSpacing( 	double distance, 	SpacingRuleJustification just, 	double gridlinesRotation, 	double offset ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetLayoutMinimumSpacing ( _ 	distance As Double, _ 	just As SpacingRuleJustification, _ 	gridlinesRotation As Double, _ 	offset As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetLayoutMinimumSpacing( 	double distance,  	SpacingRuleJustification just,  	double gridlinesRotation,  	double offset ) ``` |

#### Parameters

distance
:   Type:  System Double

just
:   Type:  Autodesk.Revit.DB SpacingRuleJustification

gridlinesRotation
:   Type:  System Double

offset
:   Type:  System Double

# Remarks

When changing the Layout to MinimumSpacing, you must also simultaneously set the Distance, Justification, GridlinesRotation, and Offset properties.

# See Also

SpacingRule Class

Autodesk.Revit.DB Namespace

#### IsSystemClassificationValid Method

---

|  |
| --- |
| ConnectorElement Class   See Also |

Checks that the MEPSystemType is valid for the domain of connector.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsSystemClassificationValid( 	MEPSystemClassification systemClassification ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsSystemClassificationValid ( _ 	systemClassification As MEPSystemClassification _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsSystemClassificationValid( 	MEPSystemClassification systemClassification ) ``` |

#### Parameters

systemClassification
:   Type:  Autodesk.Revit.DB MEPSystemClassification
     The MEPSystemType to be validated.

#### Return Value

True if the MEPSystemType is valid for the domain of the connector, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ConnectorElement Class

Autodesk.Revit.DB Namespace

#### FloorRecreateFailedWarning Property

---

|  |
| --- |
| BuiltInFailures MassFailures Class   See Also |

The floor cannot be created because no suitable level in the target document can be found.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FloorRecreateFailedWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FloorRecreateFailedWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FloorRecreateFailedWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MassFailures Class

Autodesk.Revit.DB Namespace

#### ElementId Property

---

|  |
| --- |
| LinkLoadResult Class   See Also |

The id of the created or loaded linked model.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ElementId ElementId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ElementId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ ElementId { 	ElementId^ get (); } ``` |

# Remarks

This may be invalidElementId if there were errors (for example, LinkLoadResultType.SameModelAsHost causes no link to be created).

# See Also

LinkLoadResult Class

Autodesk.Revit.DB Namespace

#### Erase Method

---

|  |
| --- |
| DefinitionBindingMap Class   See Also |

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Erase( 	Definition key ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function Erase ( _ 	key As Definition _ ) As Integer ``` |

| Visual C++ |
| --- |
| ``` public: virtual int Erase( 	Definition^ key ) ``` |

#### Parameters

key
:   Type:  Autodesk.Revit.DB Definition

# See Also

DefinitionBindingMap Class

Autodesk.Revit.DB Namespace

#### CreationFailed Property

---

|  |
| --- |
| BuiltInFailures MatchlineFailures Class   See Also |

Matchline top extent should be higher than its bottom.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CreationFailed { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CreationFailed As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CreationFailed { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MatchlineFailures Class

Autodesk.Revit.DB Namespace

#### SetToIdentity Method

---

|  |
| --- |
| Transform2D Class   See Also |

Set this TrfUV to the identity transform.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public Transform2D SetToIdentity() ``` |

| Visual Basic |
| --- |
| ``` Public Function SetToIdentity As Transform2D ``` |

| Visual C++ |
| --- |
| ``` public: Transform2D^ SetToIdentity() ``` |

#### Return Value

Returns a pointer to "this"  Transform2D  .

# See Also

Transform2D Class

Autodesk.Revit.DB Namespace

#### ActivateControlsAndDimensionsOnMultiSelect Property

---

|  |
| --- |
| SelectionUIOptions Class   See Also |

Indicates whether controls and temporary dimensions are activated on selection of multiple elements.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public bool ActivateControlsAndDimensionsOnMultiSelect { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ActivateControlsAndDimensionsOnMultiSelect As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool ActivateControlsAndDimensionsOnMultiSelect { 	bool get (); 	void set (bool value); } ``` |

# Remarks

Revit always shows certain controls and temporary dimensions for a single selected element When this option is set Revit also shows these controls and dimensions when multiple elements are selected. Note that this setting takes effect on the next selection change. To have this change take effect immediately use

 Copy  C#

```
Selection.SetElementIds(Selection.GetElementIds());
```

# See Also

SelectionUIOptions Class

Autodesk.Revit.UI Namespace

#### FaceNode Class

---

|  |
| --- |
| Members   See Also |

An output node that represents a Face.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public class FaceNode : RenderNode ``` |

| Visual Basic |
| --- |
| ``` Public Class FaceNode _ 	Inherits RenderNode ``` |

| Visual C++ |
| --- |
| ``` public ref class FaceNode : public RenderNode ``` |

# Remarks

See also:  OnFaceBegin(FaceNode)  .

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB RenderNode
  Autodesk.Revit.DB FaceNode

# See Also

FaceNode Members

Autodesk.Revit.DB Namespace

#### Create Method (Document, Reference)

---

|  |
| --- |
| SketchPlane Class   See Also |

Creates a new sketch plane from a reference to a planar face.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static SketchPlane Create( 	Document document, 	Reference planarFaceReference ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	planarFaceReference As Reference _ ) As SketchPlane ``` |

| Visual C++ |
| --- |
| ``` public: static SketchPlane^ Create( 	Document^ document,  	Reference^ planarFaceReference ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

planarFaceReference
:   Type:  Autodesk.Revit.DB Reference
     The reference of the planar face where the sketch plane will be created.

#### Return Value

The newly created sketch plane.

# Remarks

A reference relationship will be created between the face and the sketch plane.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Sketch plane creation is not allowed in this family. -or- The reference is not a planar face. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

SketchPlane Class

Create Overload

Autodesk.Revit.DB Namespace

#### RebarFreeFormHookStartPlaneAngle Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Hook Orientation At Start"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarFreeFormHookStartPlaneAngle { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarFreeFormHookStartPlaneAngle As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarFreeFormHookStartPlaneAngle { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### FlowState Property

---

|  |
| --- |
| Pipe Class   See Also |

The flow state of the pipe.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public PipeFlowState FlowState { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property FlowState As PipeFlowState 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property PipeFlowState FlowState { 	PipeFlowState get (); } ``` |

# See Also

Pipe Class

Autodesk.Revit.DB.Plumbing Namespace

#### JoulesPerSquareMeterKelvin Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Joules per square meter Kelvin.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId JoulesPerSquareMeterKelvin { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property JoulesPerSquareMeterKelvin As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ JoulesPerSquareMeterKelvin { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### ReverseIterator Method

---

|  |
| --- |
| PlanTopologySet Class   See Also |

Retrieve a backward moving iterator to the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual PlanTopologySetIterator ReverseIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ReverseIterator As PlanTopologySetIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual PlanTopologySetIterator^ ReverseIterator() ``` |

#### Return Value

Returns a backward moving iterator to the set.

# See Also

PlanTopologySet Class

Autodesk.Revit.DB Namespace

#### FindReferenceTarget Enumeration

---

|  |
| --- |
| See Also |

The type of reference to find from a ReferenceIntersector.

The type of reference to find

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum FindReferenceTarget ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration FindReferenceTarget ``` |

| Visual C++ |
| --- |
| ``` public enum class FindReferenceTarget ``` |

# Members

| Member name | Description |
| --- | --- |
| Element | An element. |
| Mesh | A mesh. |
| Edge | An edge. |
| Curve | A curve. |
| Face | A face. |
| All | All target types. |

# See Also

Autodesk.Revit.DB Namespace

#### GetIntersectingElements Method

---

|  |
| --- |
| DividedPath Class   See Also |

Get the elements whose intersection with path produces points.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ICollection<ElementId> GetIntersectingElements() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetIntersectingElements As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: ICollection<ElementId^>^ GetIntersectingElements() ``` |

# See Also

DividedPath Class

Autodesk.Revit.DB Namespace

#### Distance Property

---

|  |
| --- |
| WallSweepInfo Class   See Also |

Represents the distance from either the top or base of the wall for horizontal sweeps, or the parameter along the wall's path curve for vertical ones.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public double Distance { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Distance As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Distance { 	double get (); 	void set (double value); } ``` |

#### Field Value

DistanceMeasuredFrom determines where the measurement starts from, depending on the orientation of the sweep. If the sweep or reveal is vertical, this distance is equal to the parameter along the wall's path curve.

# See Also

WallSweepInfo Class

Autodesk.Revit.DB Namespace

#### MEPBuildingConstructionSet Class

---

|  |
| --- |
| Members   See Also |

A set that contains MEPBuildingConstructions.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class MEPBuildingConstructionSet : APIObject,  	IEnumerable ``` |

| Visual Basic |
| --- |
| ``` Public Class MEPBuildingConstructionSet _ 	Inherits APIObject _ 	Implements IEnumerable ``` |

| Visual C++ |
| --- |
| ``` public ref class MEPBuildingConstructionSet : public APIObject,  	IEnumerable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB.Mechanical MEPBuildingConstructionSet

# See Also

MEPBuildingConstructionSet Members

Autodesk.Revit.DB.Mechanical Namespace

#### IsMaxEdgeLengthSet Method

---

|  |
| --- |
| OBJExportOptions Class   See Also |

Checks whether the MaxEdgeLength tessellation parameter is explicitly set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public bool IsMaxEdgeLengthSet() ``` |

| Visual Basic |
| --- |
| ``` Public Function IsMaxEdgeLengthSet As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsMaxEdgeLengthSet() ``` |

#### Return Value

True if MaxEdgeLength tessellation parameter is explicitly set, false otherwise.

# See Also

OBJExportOptions Class

Autodesk.Revit.DB Namespace

#### KipFeetPerFoot Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Kip feet per foot.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId KipFeetPerFoot { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property KipFeetPerFoot As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ KipFeetPerFoot { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### Z Field

---

|  |
| --- |
| CloudPoint Structure   See Also |

The Z coordinate

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public float Z ``` |

| Visual Basic |
| --- |
| ``` Public Z As Single ``` |

| Visual C++ |
| --- |
| ``` public: float Z ``` |

# See Also

CloudPoint Structure

Autodesk.Revit.DB.PointClouds Namespace

#### HeatTransferCoefficient Property

---

|  |
| --- |
| ThermalProperties Class   See Also |

The heat transfer coefficient value (U-Value). The unit is watts per meter-squared kelvin (W/(m^2\*K)).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double HeatTransferCoefficient { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property HeatTransferCoefficient As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double HeatTransferCoefficient { 	double get (); } ``` |

# See Also

ThermalProperties Class

Autodesk.Revit.DB Namespace

#### CannotPasteViewSpecElemsFromDiffViews Property

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   See Also |

Cannot paste view-specific elements from different views.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotPasteViewSpecElemsFromDiffViews { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotPasteViewSpecElemsFromDiffViews As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotPasteViewSpecElemsFromDiffViews { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace

#### RebarSystemLayerSummaryDir2NoSpacing Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Minor, Both Faces (Brief)"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarSystemLayerSummaryDir2NoSpacing { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarSystemLayerSummaryDir2NoSpacing As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarSystemLayerSummaryDir2NoSpacing { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### AlignmentStationLabelSetEndStation Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Alignment Label Set End Station"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AlignmentStationLabelSetEndStation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AlignmentStationLabelSetEndStation As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AlignmentStationLabelSetEndStation { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CurtaingridUseCurveDistn1 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Use Curve Distance"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CurtaingridUseCurveDistn1 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CurtaingridUseCurveDistn1 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CurtaingridUseCurveDistn1 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### NoStructuralHostToAttachWarning Property

---

|  |
| --- |
| BuiltInFailures MEPFabricationFailures Class   See Also |

There is no structural component to attach the hanger rod to.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NoStructuralHostToAttachWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NoStructuralHostToAttachWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NoStructuralHostToAttachWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPFabricationFailures Class

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| PanelScheduleSheetInstance Class   See Also |

Creates a new instance of panel schedule on sheet and adds it to the document.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static PanelScheduleSheetInstance Create( 	Document ADoc, 	ElementId scheduleId, 	View DBView ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	ADoc As Document, _ 	scheduleId As ElementId, _ 	DBView As View _ ) As PanelScheduleSheetInstance ``` |

| Visual C++ |
| --- |
| ``` public: static PanelScheduleSheetInstance^ Create( 	Document^ ADoc,  	ElementId^ scheduleId,  	View^ DBView ) ``` |

#### Parameters

ADoc
:   Type:  Autodesk.Revit.DB Document

scheduleId
:   Type:  Autodesk.Revit.DB ElementId

DBView
:   Type:  Autodesk.Revit.DB View

#### Return Value

The newly created panel schedule sheet instance element.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PanelScheduleSheetInstance Class

Autodesk.Revit.DB.Electrical Namespace

#### BringForward Method (Document, View, ICollection(ElementId))

---

|  |
| --- |
| DetailElementOrderUtils Class   See Also |

Moves the given detail instances one step closer to the front of all other detail instances in the view, while keeping the order of the given ones.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static void BringForward( 	Document pDocument, 	View pDBView, 	ICollection<ElementId> detailElementIds ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub BringForward ( _ 	pDocument As Document, _ 	pDBView As View, _ 	detailElementIds As ICollection(Of ElementId) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void BringForward( 	Document^ pDocument,  	View^ pDBView,  	ICollection<ElementId^>^ detailElementIds ) ``` |

#### Parameters

pDocument
:   Type:  Autodesk.Revit.DB Document
     The document.

pDBView
:   Type:  Autodesk.Revit.DB View
     The view.

detailElementIds
:   Type:  System.Collections.Generic ICollection   ElementId
     The set of detail elementIds to bring forward.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The set detailElementIds contains one or more non-detail element Ids. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DetailElementOrderUtils Class

BringForward Overload

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| ForgeTypeId Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

ForgeTypeId Class

Autodesk.Revit.DB Namespace

#### GetLineweightTableIterator Method

---

|  |
| --- |
| ExportLineweightTable Class   See Also |

Returns a ExportLineweightTableIterator that iterates through the collection.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ExportLineweightTableIterator GetLineweightTableIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetLineweightTableIterator As ExportLineweightTableIterator ``` |

| Visual C++ |
| --- |
| ``` public: ExportLineweightTableIterator^ GetLineweightTableIterator() ``` |

#### Return Value

A ExportLineweightTableIterator object that can be used to iterate through key-value pairs in the collection.

# See Also

ExportLineweightTable Class

Autodesk.Revit.DB Namespace

#### LoadForceFy Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Fy"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LoadForceFy { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoadForceFy As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LoadForceFy { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StructuralSectionRectangular Class

---

|  |
| --- |
| Members   See Also |

Defines common set of parameters for structural section rectangular contour.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public class StructuralSectionRectangular : StructuralSection ``` |

| Visual Basic |
| --- |
| ``` Public Class StructuralSectionRectangular _ 	Inherits StructuralSection ``` |

| Visual C++ |
| --- |
| ``` public ref class StructuralSectionRectangular : public StructuralSection ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSection
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionRectangular
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionColdFormed
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionConcreteCross
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionConcreteRectangle
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionConcreteRectangleCut
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionConcreteT
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionGeneralF
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionGeneralH
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionHotRolled
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionIWelded
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionUserDefined

# See Also

StructuralSectionRectangular Members

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### GetMEPConnectorInfo Method

---

|  |
| --- |
| Connector Class   See Also |

Gets MEP connector information.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public MEPConnectorInfo GetMEPConnectorInfo() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetMEPConnectorInfo As MEPConnectorInfo ``` |

| Visual C++ |
| --- |
| ``` public: MEPConnectorInfo^ GetMEPConnectorInfo() ``` |

#### Return Value

Returns    a null reference (  Nothing  in Visual Basic)  if there is no MEP connector information associated.

# See Also

Connector Class

Autodesk.Revit.DB Namespace

#### Reset Method

---

|  |
| --- |
| Railing Class   See Also |

Resets the railing to the default one that the system generates.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void Reset() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Reset ``` |

| Visual C++ |
| --- |
| ``` public: void Reset() ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Cannot reset the railing. |

# See Also

Railing Class

Autodesk.Revit.DB.Architecture Namespace

#### ZoneEquipmentBehavior Enumeration

---

|  |
| --- |
| See Also |

The behavior of zone equipment associated with spaces.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public enum ZoneEquipmentBehavior ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ZoneEquipmentBehavior ``` |

| Visual C++ |
| --- |
| ``` public enum class ZoneEquipmentBehavior ``` |

# Members

| Member name | Description |
| --- | --- |
| OnePerSpace |  |
| GroupSpaces |  |

# See Also

Autodesk.Revit.DB.Mechanical Namespace

#### IPointSetIterator Interface

---

|  |
| --- |
| Members   See Also |

An interface that Revit will call when iterating through sets of points on the engine.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public interface IPointSetIterator ``` |

| Visual Basic |
| --- |
| ``` Public Interface IPointSetIterator ``` |

| Visual C++ |
| --- |
| ``` public interface class IPointSetIterator ``` |

# Remarks

An instance of this interface is obtained from the Point Cloud engine when the engine's CreatePointSetIterator method is called.

# See Also

IPointSetIterator Members

Autodesk.Revit.DB.PointClouds Namespace

#### PipePressureDropService Property

---

|  |
| --- |
| ExternalServices BuiltInExternalServices Class   See Also |

The external service which permits registration of an alternate implementation for pipe pressure drop calculation. To use this service, programmers implement a server class that derives from  IPipePressureDropServer  .

**Namespace:**   Autodesk.Revit.DB.ExternalService
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public static ExternalServiceId PipePressureDropService { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PipePressureDropService As ExternalServiceId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ExternalServiceId^ PipePressureDropService { 	ExternalServiceId^ get (); } ``` |

# See Also

ExternalServices BuiltInExternalServices Class

Autodesk.Revit.DB.ExternalService Namespace

#### ElementArrayIterator Class

---

|  |
| --- |
| Members   See Also |

An iterator to an element array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public abstract class ElementArrayIterator : APIObject,  	IEnumerator ``` |

| Visual Basic |
| --- |
| ``` Public MustInherit Class ElementArrayIterator _ 	Inherits APIObject _ 	Implements IEnumerator ``` |

| Visual C++ |
| --- |
| ``` public ref class ElementArrayIterator abstract : public APIObject,  	IEnumerator ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB ElementArrayIterator

# See Also

ElementArrayIterator Members

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| ConicalSurface Class   See Also |

Creates a conical surface defined by a local reference frame and a half angle.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static ConicalSurface Create( 	Frame frameOfReference, 	double halfAngle ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	frameOfReference As Frame, _ 	halfAngle As Double _ ) As ConicalSurface ``` |

| Visual C++ |
| --- |
| ``` public: static ConicalSurface^ Create( 	Frame^ frameOfReference,  	double halfAngle ) ``` |

#### Parameters

frameOfReference
:   Type:  Autodesk.Revit.DB Frame
     frameOfReference is an orthonormal frame that defines a local coordinate system for the cone.

    * Frame.Origin is a point on the cylinder's axis.
    * Frame.BasisZ points along the axis, while Frame.BasisX and Frame.BasisY are orthogonal to the axis.
    * The frame may be either left-handed or right-handed (see Frame.IsRightHanded). Note that the "handedness" of the frame does not, by itself, determine the surface's orientation.

halfAngle
:   Type:  System Double
     Cone angle. Must be not 0, lesser than PI/2 and greater than -PI/2.

#### Return Value

The created ConicalSurface.

# Remarks

The parametric equation of the cone is S(u, v) = Frame.Origin + v\*[sin(halfAngle)(cos(u)\*Frame.BasisX + sin(u)\*Frame.BasisY) + cos(halfAngle)\*Frame.BasisZ] This implies the following facts:

* Frame.BasisX points from the axis point to the point on the cylinder with coordinates (0, 0).
* Frame.BasisY points in the direction of the partial derivative dS/du at (0, 0).
* Frame.BasisZ points in the direction of the partial derivative dS/dv at (0, 0).

Only the branch of the cone with v >= 0 should be used.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | This Frame object may not be used as a local frame of reference. -or- The supplied value must be not 0, lesser than PI/2 and greater than -PI/2. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ConicalSurface Class

Autodesk.Revit.DB Namespace

#### TextStyleItalic Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Italic"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId TextStyleItalic { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextStyleItalic As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ TextStyleItalic { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StairsDesiredNumberOfRisers Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Desired Number of Risers": The number of risers is calculated based on stairs height

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsDesiredNumberOfRisers { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsDesiredNumberOfRisers As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsDesiredNumberOfRisers { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### FabricSheetMajorDirectionWireType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Major Direction Wire Type": Major Direction Wire Type

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FabricSheetMajorDirectionWireType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricSheetMajorDirectionWireType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FabricSheetMajorDirectionWireType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CannotLockThisDimension Property

---

|  |
| --- |
| BuiltInFailures DimensionFailures Class   See Also |

Can't lock this Dimension because it breaks formulas

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotLockThisDimension { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotLockThisDimension As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotLockThisDimension { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DimensionFailures Class

Autodesk.Revit.DB Namespace

#### TextureAngle Property

---

|  |
| --- |
| Wave Class   See Also |

The property labeled "Angle" from the "Wave" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TextureAngle { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextureAngle As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TextureAngle { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDoubleArray3d".

# See Also

Wave Class

Autodesk.Revit.DB.Visual Namespace

#### Utility Property

---

|  |
| --- |
| Connector Class   See Also |

Indicates if the connector is a utility connector.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public bool Utility { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Utility As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool Utility { 	bool get (); } ``` |

# See Also

Connector Class

Autodesk.Revit.DB Namespace

#### GetCurveLoops Method

---

|  |
| --- |
| RoofComponents Class   See Also |

The CurveLoops of roof slabs.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public IList<CurveLoop> GetCurveLoops() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetCurveLoops As IList(Of CurveLoop) ``` |

| Visual C++ |
| --- |
| ``` public: IList<CurveLoop^>^ GetCurveLoops() ``` |

#### Return Value

The CurveLoops.

# See Also

RoofComponents Class

Autodesk.Revit.DB.IFC Namespace

#### DegreeU Property

---

|  |
| --- |
| NurbsSurfaceData Class   See Also |

The degree of the spline in the u-direction.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public int DegreeU { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property DegreeU As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int DegreeU { 	int get (); } ``` |

# See Also

NurbsSurfaceData Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| ScheduleHeightsOnSheet Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

ScheduleHeightsOnSheet Class

Autodesk.Revit.DB Namespace

#### Export Method (String, String, STLExportOptions)

---

|  |
| --- |
| Document Class   See Also |

Exports a view specified in the export options to the STL format.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2021.1

# Syntax

| C# |
| --- |
| ``` public bool Export( 	string folder, 	string name, 	STLExportOptions options ) ``` |

| Visual Basic |
| --- |
| ``` Public Function Export ( _ 	folder As String, _ 	name As String, _ 	options As STLExportOptions _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool Export( 	String^ folder,  	String^ name,  	STLExportOptions^ options ) ``` |

#### Parameters

folder
:   Type:  System String
     Output folder into which the file will be exported. The folder must exist.

name
:   Type:  System String
     Indicates the name of the STL file to export. If it doesn't end with ".stl", this extension will be added automatically. The name cannot contain any of the following characters: \/:\*?"<>|. Empty name is not acceptable.

options
:   Type:  Autodesk.Revit.DB STLExportOptions
     Various options applicable to the STL format.

#### Return Value

True if successful, otherwise False.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | NullOrEmpty -or- Contains invalid characters. -or- The provided options are not valid. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ForbiddenForDynamicUpdateException | This method may not be called during dynamic update. |
| Autodesk.Revit.Exceptions InvalidOperationException | Export is temporarily disabled. -or- Exporting is not allowed in the current application mode. |
| Autodesk.Revit.Exceptions InvalidPathArgumentException | The folder does not exist. |
| Autodesk.Revit.Exceptions OptionalFunctionalityNotAvailableException | The ShapeExporter functionality is not available in the installed Revit. |

# See Also

Document Class

Export Overload

Autodesk.Revit.DB Namespace

#### MepZoneAirLoop Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Air System"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MepZoneAirLoop { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MepZoneAirLoop As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MepZoneAirLoop { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Roughness Property

---

|  |
| --- |
| MEPCurveType Class   See Also |

The roughness of the MEP curve type. For PipeTypes, please use Segment::Roughness

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double Roughness { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Roughness As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Roughness { 	double get (); 	void set (double value); } ``` |

# See Also

MEPCurveType Class

Autodesk.Revit.DB Namespace

#### Insert Method

---

|  |
| --- |
| ParameterSet Class   See Also |

Insert the specified parameter into the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool Insert( 	Parameter item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function Insert ( _ 	item As Parameter _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool Insert( 	Parameter^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB Parameter
     The parameter to be inserted into the set.

#### Return Value

Returns whether the parameter was inserted into the set.

# See Also

ParameterSet Class

Autodesk.Revit.DB Namespace

#### References Property

---

|  |
| --- |
| Dimension Class   See Also |

Returns an array of geometric references to which the dimension is attached.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ReferenceArray References { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property References As ReferenceArray 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ReferenceArray^ References { 	ReferenceArray^ get (); } ``` |

# See Also

Dimension Class

Autodesk.Revit.DB Namespace

#### Behavior Property

---

|  |
| --- |
| ThermalAsset Class   See Also |

Flag indicating whether elements of this material behave isotropically or orthotropically.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public StructuralBehavior Behavior { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Behavior As StructuralBehavior 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property StructuralBehavior Behavior { 	StructuralBehavior get (); 	void set (StructuralBehavior value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ThermalAsset Class

Autodesk.Revit.DB Namespace

#### GetPipeSlopes Method

---

|  |
| --- |
| PipeSettings Class   See Also |

Get pipe slopes.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public IList<double> GetPipeSlopes() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetPipeSlopes As IList(Of Double) ``` |

| Visual C++ |
| --- |
| ``` public: IList<double>^ GetPipeSlopes() ``` |

#### Return Value

Pipe slope values. Revit stores the slope value as a percentage (0-100).

# See Also

PipeSettings Class

Autodesk.Revit.DB.Plumbing Namespace

#### AttachedGroupNoMirror Property

---

|  |
| --- |
| BuiltInFailures GroupFailures Class   See Also |

Attached detail groups cannot be mirrored without also mirroring their parent group.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId AttachedGroupNoMirror { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AttachedGroupNoMirror As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ AttachedGroupNoMirror { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GroupFailures Class

Autodesk.Revit.DB Namespace

#### BRepBuilderState Enumeration

---

|  |
| --- |
| See Also |

This class defines an enumerative type used to specify the state of a BRepBuilder object.

This enumerative type corresponds to the possible states of a BRepBuilder object.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public enum BRepBuilderState ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration BRepBuilderState ``` |

| Visual C++ |
| --- |
| ``` public enum class BRepBuilderState ``` |

# Members

| Member name | Description |
| --- | --- |
| InvalidState | BRepBuilder is in an invalid state. No further productive use is possible. |
| AcceptingData | BRepBuilder is accumulating data. New b-rep components such as edges or faces may be added. |
| Completed | Finish() successfully created a valid Geometry object. No new data may be added.The built object may be retrieved via GetResult(). |

# See Also

Autodesk.Revit.DB Namespace

#### GetParameter Method

---

|  |
| --- |
| Element Class   See Also |

Retrieves a parameter from the element given identifier.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public Parameter GetParameter( 	ForgeTypeId parameterTypeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetParameter ( _ 	parameterTypeId As ForgeTypeId _ ) As Parameter ``` |

| Visual C++ |
| --- |
| ``` public: Parameter^ GetParameter( 	ForgeTypeId^ parameterTypeId ) ``` |

#### Parameters

parameterTypeId
:   Type:  Autodesk.Revit.DB ForgeTypeId
     Identifier of the built-in parameter.

# Remarks

Parameters are a generic form of data storage within elements. The parameters are visible through the Autodesk Revit user interface in the Element Properties dialog. This method uses a built in parameter identifier to access the parameter. Autodesk Revit has a large number of built in parameters that are available via static properties.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | parameterTypeId does not identify a built-in parameter. See Parameter.IsBuiltInParameter(ForgeTypeId) and Parameter.GetParameterTypeId(BuiltInParameter). |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was NULL |

# See Also

Element Class

Autodesk.Revit.DB Namespace

#### StructuralSectionCommonShearAreaStrongAxis Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Shear Area strong axis"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralSectionCommonShearAreaStrongAxis { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralSectionCommonShearAreaStrongAxis As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralSectionCommonShearAreaStrongAxis { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### BuiltInFailures.PathOfTravelFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures about PathOfTravel.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public static class PathOfTravelFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class PathOfTravelFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class PathOfTravelFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures PathOfTravelFailures

# See Also

BuiltInFailures PathOfTravelFailures Members

Autodesk.Revit.DB Namespace

#### AppendShape Method (IList(GeometryObject), DirectShapeTargetViewType)

---

|  |
| --- |
| DirectShapeType Class   See Also |

Appends the collection of GeometryObjects into the model or view specific shape representation stored in this DirectShapeType. Passing DirectShapeTargetViewType.Default as view type will cause the model shape to be updated.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public void AppendShape( 	IList<GeometryObject> pGeomArr, 	DirectShapeTargetViewType viewType ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AppendShape ( _ 	pGeomArr As IList(Of GeometryObject), _ 	viewType As DirectShapeTargetViewType _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AppendShape( 	IList<GeometryObject^>^ pGeomArr,  	DirectShapeTargetViewType viewType ) ``` |

#### Parameters

pGeomArr
:   Type:  System.Collections.Generic IList   GeometryObject
     Shape expressed as a collection of GeometryObjects. For viewType = DirectShapeTargetViewType::Default, the supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point, Curve and PolyLine. For viewType = DirectShapeTargetViewType::Plan, the supported types of GeometryObjects are: Point and Curve.

viewType
:   Type:  Autodesk.Revit.DB DirectShapeTargetViewType
     Passing DirectShapeTargetViewType.Default as view type will cause the default shape to be appended.

# Remarks

The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be joined with the appended geometry. It is up to the caller to ensure that the combination of geometry will have the correct appearance in Revit.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | At least one member of pGeomArr does not satisfy DirectShapeType validation criteria. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

DirectShapeType Class

AppendShape Overload

Autodesk.Revit.DB Namespace

#### CreateDefaultEndTreatmentType Method

---

|  |
| --- |
| EndTreatmentType Class   See Also |

Creates a new EndTreatmentType object with a default name.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static ElementId CreateDefaultEndTreatmentType( 	Document ADoc ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateDefaultEndTreatmentType ( _ 	ADoc As Document _ ) As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: static ElementId^ CreateDefaultEndTreatmentType( 	Document^ ADoc ) ``` |

#### Parameters

ADoc
:   Type:  Autodesk.Revit.DB Document
     The document.

#### Return Value

The newly created type id.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

EndTreatmentType Class

Autodesk.Revit.DB.Structure Namespace

#### AreTargetAndFallbackCompatible Method

---

|  |
| --- |
| TessellatedShapeBuilder Class   See Also |

Checks whether this combination of fallback and target parameters can be used as a valid combination of inputs.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public bool AreTargetAndFallbackCompatible( 	TessellatedShapeBuilderTarget target, 	TessellatedShapeBuilderFallback fallback ) ``` |

| Visual Basic |
| --- |
| ``` Public Function AreTargetAndFallbackCompatible ( _ 	target As TessellatedShapeBuilderTarget, _ 	fallback As TessellatedShapeBuilderFallback _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool AreTargetAndFallbackCompatible( 	TessellatedShapeBuilderTarget target,  	TessellatedShapeBuilderFallback fallback ) ``` |

#### Parameters

target
:   Type:  Autodesk.Revit.DB TessellatedShapeBuilderTarget
     What kind of geometrical objects should be built.

fallback
:   Type:  Autodesk.Revit.DB TessellatedShapeBuilderFallback
     What should be done if a geometrical object described by 'target' parameter cannot be built using all data from all stored face sets.

#### Return Value

True if the combination of fallback and target are a valid combination, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

TessellatedShapeBuilder Class

Autodesk.Revit.DB Namespace

#### BadReferenceBetweenOptions Property

---

|  |
| --- |
| BuiltInFailures DesignOptionFailures Class   See Also |

An element may not reference an element in another Option of the same Option Set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId BadReferenceBetweenOptions { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BadReferenceBetweenOptions As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ BadReferenceBetweenOptions { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DesignOptionFailures Class

Autodesk.Revit.DB Namespace

#### DivisionGeometry Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Division Geometry"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DivisionGeometry { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DivisionGeometry As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DivisionGeometry { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### Assign Method

---

|  |
| --- |
| PointCloudOverrides Class   See Also |

Assigns values of the source overrides to this object.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void Assign( 	PointCloudOverrides other ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub Assign ( _ 	other As PointCloudOverrides _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void Assign( 	PointCloudOverrides^ other ) ``` |

#### Parameters

other
:   Type:  Autodesk.Revit.DB.PointClouds PointCloudOverrides
     The source overrides.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PointCloudOverrides Class

Autodesk.Revit.DB.PointClouds Namespace

#### Dispose Method

---

|  |
| --- |
| IFCImportOptions Class   See Also |

Releases all resources used by the  IFCImportOptions

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

IFCImportOptions Class

Autodesk.Revit.DB.IFC Namespace

#### Erase Method

---

|  |
| --- |
| PlanCircuitSet Class   See Also |

Removes a specified object from the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Erase( 	PlanCircuit item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function Erase ( _ 	item As PlanCircuit _ ) As Integer ``` |

| Visual C++ |
| --- |
| ``` public: virtual int Erase( 	PlanCircuit^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB PlanCircuit
     The item to be erased.

#### Return Value

The number of items that were erased from the set.

# See Also

PlanCircuitSet Class

Autodesk.Revit.DB Namespace

#### ReadPoints Method

---

|  |
| --- |
| IPointSetIterator Interface   See Also |

Implement this method to fill the provided buffer with points up to the number of maximum points for which the buffer was allocated.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` int ReadPoints( 	IntPtr buffer, 	int bufferSize ) ``` |

| Visual Basic |
| --- |
| ``` Function ReadPoints ( _ 	buffer As IntPtr, _ 	bufferSize As Integer _ ) As Integer ``` |

| Visual C++ |
| --- |
| ``` int ReadPoints( 	IntPtr buffer,  	int bufferSize ) ``` |

#### Parameters

buffer
:   Type:  System IntPtr
     Memory buffer into which the points should be written. The buffer was allocated by Revit and it is guaranteed to be valid for the duration of the call.

bufferSize
:   Type:  System Int32
     The maximum number of CloudPoint objects that may be copied into the buffer.

#### Return Value

The actual number of CloudPoint objects placed in the buffer (can be less than the length of the buffer). If there are no more points available, return 0.

# See Also

IPointSetIterator Interface

Autodesk.Revit.DB.PointClouds Namespace

#### Color2 Property

---

|  |
| --- |
| PointCloudColorSettings Class   See Also |

Color 2

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public Color Color2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Color2 As Color 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Color^ Color2 { 	Color^ get (); } ``` |

# See Also

PointCloudColorSettings Class

Autodesk.Revit.DB.PointClouds Namespace

#### IsFontUnderline Property

---

|  |
| --- |
| TableCellStyle Class   See Also |

Gets or sets whether the text font is set to Underline of this cell.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsFontUnderline { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property IsFontUnderline As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsFontUnderline { 	bool get (); 	void set (bool value); } ``` |

#### Field Value

true if the font is Underline; otherwise false.

# See Also

TableCellStyle Class

Autodesk.Revit.DB Namespace

#### GetMaterialAbbreviation Method

---

|  |
| --- |
| FabricationConfiguration Class   See Also |

Gets the abreviation of the material or the insulation or the double wall material.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public string GetMaterialAbbreviation( 	int materialId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetMaterialAbbreviation ( _ 	materialId As Integer _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: String^ GetMaterialAbbreviation( 	int materialId ) ``` |

#### Parameters

materialId
:   Type:  System Int32
     The material identifier.

# See Also

FabricationConfiguration Class

Autodesk.Revit.DB Namespace

#### StartJoinCutback Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Start Join Cutback"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StartJoinCutback { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StartJoinCutback As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StartJoinCutback { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Voltage Property

---

|  |
| --- |
| AnalyticalPowerSourceData Class   See Also |

The voltage value of the analytical power source.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public double Voltage { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Voltage As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Voltage { 	double get (); 	void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The given value for voltage is not a number -or- When setting this property: The given value for voltage is not finite |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for voltage must be positive. |

# See Also

AnalyticalPowerSourceData Class

Autodesk.Revit.DB.Electrical Namespace

#### CannotKeepReferenceOfJoinedElement Property

---

|  |
| --- |
| BuiltInFailures JoinElementsFailures Class   See Also |

Can't keep reference of joined element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotKeepReferenceOfJoinedElement { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotKeepReferenceOfJoinedElement As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotKeepReferenceOfJoinedElement { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures JoinElementsFailures Class

Autodesk.Revit.DB Namespace

#### Rebar Property

---

|  |
| --- |
| NumberingSchemaTypes StructuralNumberingSchemas Class   See Also |

Built-in schema used for numbering rebar elements

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static NumberingSchemaType Rebar { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Rebar As NumberingSchemaType 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property NumberingSchemaType^ Rebar { 	NumberingSchemaType^ get (); } ``` |

# See Also

NumberingSchemaTypes StructuralNumberingSchemas Class

Autodesk.Revit.DB Namespace

#### AlternateUnitsSuffix Property

---

|  |
| --- |
| DimensionType Class   See Also |

The suffix text for the alternate units value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public string AlternateUnitsSuffix { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property AlternateUnitsSuffix As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ AlternateUnitsSuffix { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

DimensionType Class

Autodesk.Revit.DB Namespace

#### PathReinforcementClosedLoop Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

Sketch contains a closed loop. Can't create Path Reinforcement.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId PathReinforcementClosedLoop { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PathReinforcementClosedLoop As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ PathReinforcementClosedLoop { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### ForwardIterator Method

---

|  |
| --- |
| FamilyTypeSet Class   See Also |

Retrieve a forward moving iterator to the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual FamilyTypeSetIterator ForwardIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ForwardIterator As FamilyTypeSetIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual FamilyTypeSetIterator^ ForwardIterator() ``` |

#### Return Value

Returns a forward moving iterator to the set.

# See Also

FamilyTypeSet Class

Autodesk.Revit.DB Namespace

#### FabricationPartWidthIn Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Main Primary Width"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FabricationPartWidthIn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationPartWidthIn As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FabricationPartWidthIn { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Angle Property

---

|  |
| --- |
| DuctFittingAndAccessoryConnectorData Class   See Also |

the angle of the fitting, Units:(rad).

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public double Angle { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Angle As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double Angle { 	double get (); } ``` |

# See Also

DuctFittingAndAccessoryConnectorData Class

Autodesk.Revit.DB.Mechanical Namespace

#### RebarHooksDontMatchShape Property

---

|  |
| --- |
| BuiltInFailures RebarFailures Class   See Also |

The Rebar's hooks do not match its Rebar Shape.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RebarHooksDontMatchShape { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarHooksDontMatchShape As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RebarHooksDontMatchShape { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarFailures Class

Autodesk.Revit.DB Namespace

#### AnalysisDisplayStyleDiagramFenceType Enumeration

---

|  |
| --- |
| See Also |

Defines fence visualization types for diagram settings of analysis display style.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum AnalysisDisplayStyleDiagramFenceType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration AnalysisDisplayStyleDiagramFenceType ``` |

| Visual C++ |
| --- |
| ``` public enum class AnalysisDisplayStyleDiagramFenceType ``` |

# Members

| Member name | Description |
| --- | --- |
| ShowAll | Show fence for each point |
| ShowNone | Don't show fence |
| ShowPredefined | Show fence only for points that have flag ValueAtPointFlags::DisplayFence |

# See Also

Autodesk.Revit.DB.Analysis Namespace

#### Size Property

---

|  |
| --- |
| WireConduitTypeSet Class   See Also |

Returns the number of conduit types that are in the set.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Size { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Size As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property int Size { 	int get (); } ``` |

# See Also

WireConduitTypeSet Class

Autodesk.Revit.DB.Electrical Namespace

#### IsEmpty Property

---

|  |
| --- |
| SymbolicCurveArray Class   See Also |

Test to see if the array is empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool IsEmpty { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property IsEmpty As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property bool IsEmpty { 	bool get (); } ``` |

# Remarks

If the array is empty then True will be returned, otherwise False.

# See Also

SymbolicCurveArray Class

Autodesk.Revit.DB Namespace

#### FabricLocation Property

---

|  |
| --- |
| FabricArea Class   See Also |

The Fabric location in the host.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public FabricLocation FabricLocation { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property FabricLocation As FabricLocation 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property FabricLocation FabricLocation { 	FabricLocation get (); 	void set (FabricLocation value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also

FabricArea Class

Autodesk.Revit.DB.Structure Namespace

#### VertexStreamPositionNormal Class

---

|  |
| --- |
| Members   See Also |

A stream that can be used to write vertices of type  VertexPositionNormal  into a buffer (see  VertexBuffer  ).

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public class VertexStreamPositionNormal : VertexStream ``` |

| Visual Basic |
| --- |
| ``` Public Class VertexStreamPositionNormal _ 	Inherits VertexStream ``` |

| Visual C++ |
| --- |
| ``` public ref class VertexStreamPositionNormal : public VertexStream ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.DirectContext3D VertexStream
  Autodesk.Revit.DB.DirectContext3D VertexStreamPositionNormal

# See Also

VertexStreamPositionNormal Members

Autodesk.Revit.DB.DirectContext3D Namespace

#### MacroLevel Property

---

|  |
| --- |
| MacroManager Class   See Also |

The Macro level.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public MacroLevel MacroLevel { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property MacroLevel As MacroLevel 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property MacroLevel MacroLevel { 	MacroLevel get (); } ``` |

# See Also

MacroManager Class

Autodesk.Revit.DB.Macros Namespace

#### CreateNotEndsWithRule Method (ElementId, String)

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

Creates a filter rule that determines whether strings from the document do not end with a certain string value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public static FilterRule CreateNotEndsWithRule( 	ElementId parameter, 	string value ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateNotEndsWithRule ( _ 	parameter As ElementId, _ 	value As String _ ) As FilterRule ``` |

| Visual C++ |
| --- |
| ``` public: static FilterRule^ CreateNotEndsWithRule( 	ElementId^ parameter,  	String^ value ) ``` |

#### Parameters

parameter
:   Type:  Autodesk.Revit.DB ElementId
     A string-typed parameter used to get values from the document for a given element.

value
:   Type:  System String
     The user-supplied string value for which values from the document will be searched.

#### Return Value

Created filter rule object.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ParameterFilterRuleFactory Class

CreateNotEndsWithRule Overload

Autodesk.Revit.DB Namespace

#### SetLayoutAsMaximumSpacing Method

---

|  |
| --- |
| RebarShapeDrivenAccessor Class   See Also |

Sets the Layout Rule property of rebar set to MaximumSpacing

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public void SetLayoutAsMaximumSpacing( 	double spacing, 	double arrayLength, 	bool barsOnNormalSide, 	bool includeFirstBar, 	bool includeLastBar ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetLayoutAsMaximumSpacing ( _ 	spacing As Double, _ 	arrayLength As Double, _ 	barsOnNormalSide As Boolean, _ 	includeFirstBar As Boolean, _ 	includeLastBar As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetLayoutAsMaximumSpacing( 	double spacing,  	double arrayLength,  	bool barsOnNormalSide,  	bool includeFirstBar,  	bool includeLastBar ) ``` |

#### Parameters

spacing
:   Type:  System Double
     The maximum spacing between rebar in rebar set

arrayLength
:   Type:  System Double
     The distribution length of rebar set

barsOnNormalSide
:   Type:  System Boolean
     Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal

includeFirstBar
:   Type:  System Boolean
     Identifies if the first bar in rebar set is shown

includeLastBar
:   Type:  System Boolean
     Identifies if the last bar in rebar set is shown

# Remarks

When changing the layout rule to MaximumSpacing, you must also simultaneously set Spacing, SetLength, BarsOnNormalSide, IncludeFirstBar, and IncludeLastBar properties.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | The spacing isn't bigger than 0.0. -or- the set length arrayLength isn't acceptable. |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InapplicableDataException | This RebarShapeDrivenAccessor is an instance of a spiral or multiplanar shape. |
| Autodesk.Revit.Exceptions InvalidOperationException | This RebarShapeDrivenAccessor doesn't contain a valid rebar reference. |

# See Also

RebarShapeDrivenAccessor Class

Autodesk.Revit.DB.Structure Namespace

#### CreateParts Method (Document, ICollection(LinkElementId))

---

|  |
| --- |
| PartUtils Class   See Also |

Creates a new set of parts out of the original elements.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static void CreateParts( 	Document document, 	ICollection<LinkElementId> hostOrLinkElementIds ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub CreateParts ( _ 	document As Document, _ 	hostOrLinkElementIds As ICollection(Of LinkElementId) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void CreateParts( 	Document^ document,  	ICollection<LinkElementId^>^ hostOrLinkElementIds ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document containing the elements.

hostOrLinkElementIds
:   Type:  System.Collections.Generic ICollection   LinkElementId
     The elements that parts will be created from.

# Remarks

Parts will be added to the model after regeneration. To get the ids of the parts created by this method use PartUtils.GetAssociatedParts() with the contents of hostOrLinkElementIds.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | One or more element ids was not permitted for creating parts. HostOrLinkElements should be of a valid category and the ids should be valid and should not already be divided into parts. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

PartUtils Class

CreateParts Overload

Autodesk.Revit.DB Namespace

#### Absorptance Property

---

|  |
| --- |
| ThermalProperties Class   See Also |

Value of absorptance.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double Absorptance { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Absorptance As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Absorptance { 	double get (); 	void set (double value); } ``` |

# See Also

ThermalProperties Class

Autodesk.Revit.DB Namespace

#### NumberOfLines Property

---

|  |
| --- |
| LayoutRuleFixedNumber Class   See Also |

Get or set the number of the beams in a beam system.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public int NumberOfLines { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property NumberOfLines As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int NumberOfLines { 	int get (); 	void set (int value); } ``` |

# Remarks

The number must be positive.

# See Also

LayoutRuleFixedNumber Class

Autodesk.Revit.DB Namespace

#### XDirection Property

---

|  |
| --- |
| Ellipse Class   See Also |

The X direction.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public XYZ XDirection { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property XDirection As XYZ 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ XDirection { 	XYZ^ get (); } ``` |

# See Also

Ellipse Class

Autodesk.Revit.DB Namespace

#### ApparentPowerDensity Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Apparent Power Density, in discipline Electrical.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ApparentPowerDensity { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ApparentPowerDensity As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ApparentPowerDensity { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### CreateMultiPlaneFilter Method (IList(Plane))

---

|  |
| --- |
| PointCloudFilterFactory Class   See Also |

Creates a new point cloud filter based upon planar boundaries.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static PointCloudFilter CreateMultiPlaneFilter( 	IList<Plane> planes ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateMultiPlaneFilter ( _ 	planes As IList(Of Plane) _ ) As PointCloudFilter ``` |

| Visual C++ |
| --- |
| ``` public: static PointCloudFilter^ CreateMultiPlaneFilter( 	IList<Plane^>^ planes ) ``` |

#### Parameters

planes
:   Type:  System.Collections.Generic IList   Plane
     All planes used for filtering; positive direction of the normal should point inside the volume of interest. Only points on the "positive" side of all planes will pass the filter.

#### Return Value

Filter object; can be used to get representative set of cloud points passing through the filter.

# Remarks

The filter will check whether a point is located on the "positive" side of each plane, as indicated by the positive direction of the plane normal. Therefore, such filter implicitly defines a volume, which is the intersection of the positive half-spaces corresponding to all the planes. This volume does not have to be closed, but it will always be convex.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PointCloudFilterFactory Class

CreateMultiPlaneFilter Overload

Autodesk.Revit.DB.PointClouds Namespace

#### XYZ Constructor (Double, Double, Double)

---

|  |
| --- |
| XYZ Class   See Also |

Creates an XYZ with the supplied coordinates.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public XYZ( 	double x, 	double y, 	double z ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	x As Double, _ 	y As Double, _ 	z As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: XYZ( 	double x,  	double y,  	double z ) ``` |

#### Parameters

x
:   Type:  System Double
     The first coordinate.

y
:   Type:  System Double
     The second coordinate.

z
:   Type:  System Double
     The third coordinate.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when setting an infinite number to the X, Y or Z property. |

# See Also

XYZ Class

XYZ Overload

Autodesk.Revit.DB Namespace

#### DWGImportOptions Class

---

|  |
| --- |
| Members   See Also |

The import options used by importing DWG or DXF format file.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class DWGImportOptions : BaseImportOptions ``` |

| Visual Basic |
| --- |
| ``` Public Class DWGImportOptions _ 	Inherits BaseImportOptions ``` |

| Visual C++ |
| --- |
| ``` public ref class DWGImportOptions : public BaseImportOptions ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BaseImportOptions
  Autodesk.Revit.DB DWGImportOptions

# See Also

DWGImportOptions Members

Autodesk.Revit.DB Namespace

#### StructuralSectionISlopedFlange Constructor (Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double)

---

|  |
| --- |
| StructuralSectionISlopedFlange Class   See Also |

Creates a new instance of Structural Section I Sloped Flange shape with the associated set of parameters, used to attach to structural element.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public StructuralSectionISlopedFlange( 	double width, 	double height, 	double flangeThickness, 	double flangeThicknessLocation, 	double webThickness, 	double webFillet, 	double flangeFillet, 	double centroidHorizontal, 	double centroidVertical, 	double principalAxesAngle, 	double sectionArea, 	double perimeter, 	double nominalWeight, 	double momentOfInertiaStrongAxis, 	double momentOfInertiaWeakAxis, 	double elasticModulusStrongAxis, 	double elasticModulusWeakAxis, 	double plasticModulusStrongAxis, 	double plasticModulusWeakAxis, 	double torsionalMomentOfInertia, 	double torsionalModulus, 	double warpingConstant, 	double shearAreaStrongAxis, 	double shearAreaWeakAxis, 	double clearWebHeight, 	double webToeOfFillet, 	double boltSpacing, 	double boltDiameter, 	double slopedFlangeAngle ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	width As Double, _ 	height As Double, _ 	flangeThickness As Double, _ 	flangeThicknessLocation As Double, _ 	webThickness As Double, _ 	webFillet As Double, _ 	flangeFillet As Double, _ 	centroidHorizontal As Double, _ 	centroidVertical As Double, _ 	principalAxesAngle As Double, _ 	sectionArea As Double, _ 	perimeter As Double, _ 	nominalWeight As Double, _ 	momentOfInertiaStrongAxis As Double, _ 	momentOfInertiaWeakAxis As Double, _ 	elasticModulusStrongAxis As Double, _ 	elasticModulusWeakAxis As Double, _ 	plasticModulusStrongAxis As Double, _ 	plasticModulusWeakAxis As Double, _ 	torsionalMomentOfInertia As Double, _ 	torsionalModulus As Double, _ 	warpingConstant As Double, _ 	shearAreaStrongAxis As Double, _ 	shearAreaWeakAxis As Double, _ 	clearWebHeight As Double, _ 	webToeOfFillet As Double, _ 	boltSpacing As Double, _ 	boltDiameter As Double, _ 	slopedFlangeAngle As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: StructuralSectionISlopedFlange( 	double width,  	double height,  	double flangeThickness,  	double flangeThicknessLocation,  	double webThickness,  	double webFillet,  	double flangeFillet,  	double centroidHorizontal,  	double centroidVertical,  	double principalAxesAngle,  	double sectionArea,  	double perimeter,  	double nominalWeight,  	double momentOfInertiaStrongAxis,  	double momentOfInertiaWeakAxis,  	double elasticModulusStrongAxis,  	double elasticModulusWeakAxis,  	double plasticModulusStrongAxis,  	double plasticModulusWeakAxis,  	double torsionalMomentOfInertia,  	double torsionalModulus,  	double warpingConstant,  	double shearAreaStrongAxis,  	double shearAreaWeakAxis,  	double clearWebHeight,  	double webToeOfFillet,  	double boltSpacing,  	double boltDiameter,  	double slopedFlangeAngle ) ``` |

#### Parameters

width
:   Type:  System Double
     Section width.

height
:   Type:  System Double
     Section height, depth.

flangeThickness
:   Type:  System Double
     Flange Thickness.

flangeThicknessLocation
:   Type:  System Double
     Flange Thickness Location.

webThickness
:   Type:  System Double
     Web Thickness.

webFillet
:   Type:  System Double
     Web Fillet - fillet radius between web and flange.

flangeFillet
:   Type:  System Double
     Flange Fillet - fillet radius at the flange end.

centroidHorizontal
:   Type:  System Double
     Distance from centroid to the left extremites along horizontal axis.

centroidVertical
:   Type:  System Double
     Distance from centroid to the upper extremites along vertical axis.

principalAxesAngle
:   Type:  System Double
     Rotation angle between the principal axes and cross section reference planes.

sectionArea
:   Type:  System Double
     Cross section area.

perimeter
:   Type:  System Double
     Painting surface of the unit length.

nominalWeight
:   Type:  System Double
     Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.

momentOfInertiaStrongAxis
:   Type:  System Double
     Moment of Inertia about main strong axis (I).

momentOfInertiaWeakAxis
:   Type:  System Double
     Moment of Inertia about main weak axis (I).

elasticModulusStrongAxis
:   Type:  System Double
     Elastic section modulus about main strong axis for calculation of bending stresses.

elasticModulusWeakAxis
:   Type:  System Double
     Elastic section modulus about main weak axis for calculation of bending stresses.

plasticModulusStrongAxis
:   Type:  System Double
     Plastic section modulus in bending about main strong axis (Z, Wpl)

plasticModulusWeakAxis
:   Type:  System Double
     Plastic section modulus in bending about main weak axis.

torsionalMomentOfInertia
:   Type:  System Double
     Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation

torsionalModulus
:   Type:  System Double
     Section modulus for calculations of torsion stresses (Ct)

warpingConstant
:   Type:  System Double
     Warping constant (Cw, Iomega, H)

shearAreaStrongAxis
:   Type:  System Double
     Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).

shearAreaWeakAxis
:   Type:  System Double
     Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).

clearWebHeight
:   Type:  System Double
     Detailing depth between the web toes of the fillets, in.(mm)

webToeOfFillet
:   Type:  System Double
     Detailing distance from outer face of flange to web toe of fillet, in. (mm)

boltSpacing
:   Type:  System Double
     Standard bolt spacing, in. (mm)

boltDiameter
:   Type:  System Double
     Maximum bolt hole diameter, in. (mm)

slopedFlangeAngle
:   Type:  System Double
     Sloped flange angle. (rad)

# See Also

StructuralSectionISlopedFlange Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### PointCloudFilterFactory Class

---

|  |
| --- |
| Members   See Also |

A factory class for creating point cloud filters.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static class PointCloudFilterFactory ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class PointCloudFilterFactory ``` |

| Visual C++ |
| --- |
| ``` public ref class PointCloudFilterFactory abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.PointClouds PointCloudFilterFactory

# See Also

PointCloudFilterFactory Members

Autodesk.Revit.DB.PointClouds Namespace

#### Evaluate Method

---

|  |
| --- |
| FilterStringRuleEvaluator Class   See Also |

Derived classes override this method to implement the test that determines whether the two given string values satisfy the desired condition or not.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public bool Evaluate( 	string lhs, 	string rhs, 	bool caseSensitive ) ``` |

| Visual Basic |
| --- |
| ``` Public Function Evaluate ( _ 	lhs As String, _ 	rhs As String, _ 	caseSensitive As Boolean _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool Evaluate( 	String^ lhs,  	String^ rhs,  	bool caseSensitive ) ``` |

#### Parameters

lhs
:   Type:  System String
     A value from an element in the document.

rhs
:   Type:  System String
     The user-supplied value against which values from the document are tested.

caseSensitive
:   Type:  System Boolean
     If true, string comparisons are done case-sensitively.

#### Return Value

True if the given arguments satisfy the condition, otherwise false.

# Remarks

The arguments may be thought of as the left and right operands of a binary expression; for example, "a < b", "x >= 100", etc. The left operand comes from an element in the Revit document (e.g., the value of a parameter.) The right operand is supplied by the user when creating the filter that contains the rule that uses this evaluator.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FilterStringRuleEvaluator Class

Autodesk.Revit.DB Namespace

#### DuplicatePoints Property

---

|  |
| --- |
| BuiltInFailures OverlapFailures Class   See Also |

There are identical points in the same place. Lines created from points may not work as expected.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DuplicatePoints { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DuplicatePoints As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DuplicatePoints { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures OverlapFailures Class

Autodesk.Revit.DB Namespace

#### ViewSection Class

---

|  |
| --- |
| Members   See Also |

ViewSection covers sections, details, elevations, and callouts, all in their reference and non-reference variations.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class ViewSection : View ``` |

| Visual Basic |
| --- |
| ``` Public Class ViewSection _ 	Inherits View ``` |

| Visual C++ |
| --- |
| ``` public ref class ViewSection : public View ``` |

# Remarks

The creation functions for elevations can be found in the ElevationMarker class.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB View
  Autodesk.Revit.DB ViewSection

# See Also

ViewSection Members

Autodesk.Revit.DB Namespace

#### BackgroundStyle Enumeration

---

|  |
| --- |
| See Also |

Indicates the background style in rendering settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum BackgroundStyle ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration BackgroundStyle ``` |

| Visual C++ |
| --- |
| ``` public enum class BackgroundStyle ``` |

# Members

| Member name | Description |
| --- | --- |
| SkyNoClouds | Sky background without clouds. |
| SkyVeryFewClouds | Sky background with very few clouds. |
| SkyFewClouds | Sky background with few clouds. |
| SkyCloudy | Cloudy sky background. |
| SkyVeryCloudy | Very cloudy sky background. |
| Color | Color background. |
| Image | Image background. |
| Transparent | Transparent background |

# See Also

Autodesk.Revit.DB Namespace

#### RoomTagBadViewType Property

---

|  |
| --- |
| BuiltInFailures RoomFailures Class   See Also |

[Room] Tags can only be placed in Floor Plan, Reflected Ceiling Plan and Section Views.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RoomTagBadViewType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoomTagBadViewType As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RoomTagBadViewType { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RoomFailures Class

Autodesk.Revit.DB Namespace

#### ReferenceWithContext Class

---

|  |
| --- |
| Members   See Also |

An object including a reference to a geometric object and related context, as instance transform etc.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public class ReferenceWithContext : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class ReferenceWithContext _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class ReferenceWithContext : IDisposable ``` |

# Remarks

The ReferenceWithContext is used as the returned value from the method  [!:Autodesk::Revit::DB::Document::FindReferencesWithContextByDirection]  , ReferenceIntersector.Find(XYZ, XYZ), or ReferenceIntersector.FindNearest(XYZ, XYZ). It includes a reference intersecting a line extended in a certain direction from an origin point and the context of the geometric object, as the transform and proximity.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ReferenceWithContext

# See Also

ReferenceWithContext Members

Autodesk.Revit.DB Namespace

#### SteelElemCopeZAngle Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Plan rotation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SteelElemCopeZAngle { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SteelElemCopeZAngle As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SteelElemCopeZAngle { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsEmpty Property

---

|  |
| --- |
| VoltageTypeSet Class   See Also |

Test to see if the set is empty.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool IsEmpty { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property IsEmpty As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property bool IsEmpty { 	bool get (); } ``` |

# Remarks

If the set is empty then True will be returned, otherwise False.

# See Also

VoltageTypeSet Class

Autodesk.Revit.DB.Electrical Namespace

#### GetWidth Method

---

|  |
| --- |
| CompoundStructure Class   See Also |

The width implied by this compound structure.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double GetWidth() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetWidth As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetWidth() ``` |

#### Return Value

The width of a host object with this compound structure.

# Remarks

If the structure is not vertically compound, then this is simply the sum of all layers' widths. If the structure is vertically compound, this is the width of the rectangular grid stored in the vertically compound structure. The presence of a layer with variable width has no effect on the value returned by this method. The value returned assumes that all layers have their specified width.

# See Also

CompoundStructure Class

GetWidth Overload

Autodesk.Revit.DB Namespace

#### LineSpringCoefficient Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Line Spring Coefficient, in discipline Structural.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LineSpringCoefficient { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LineSpringCoefficient As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LineSpringCoefficient { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### NumWires Property

---

|  |
| --- |
| DistributionSysType Class   See Also |

Get or set number of wires of distribution system.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public int NumWires { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property NumWires As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int NumWires { 	int get (); 	void set (int value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | While assign a negative value to NumWires. |

# See Also

DistributionSysType Class

Autodesk.Revit.DB.Electrical Namespace

#### ExportIFCCategoryTable Property

---

|  |
| --- |
| Application Class   See Also |

Full path to the file that defines Revit category to IFC entity mappings for IFC export.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public string ExportIFCCategoryTable { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ExportIFCCategoryTable As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ ExportIFCCategoryTable { 	String^ get (); } ``` |

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### VectorAtPoint Class

---

|  |
| --- |
| Members   Example   See Also |

Stores vectors at one domain point. Each vector corresponds to a "measurement" for which this vector was calculated.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public class VectorAtPoint : ValueAtPointBase ``` |

| Visual Basic |
| --- |
| ``` Public Class VectorAtPoint _ 	Inherits ValueAtPointBase ``` |

| Visual C++ |
| --- |
| ``` public ref class VectorAtPoint : public ValueAtPointBase ``` |

# Examples

 Copy  C#

```
// Place analysis results in the form of vectors at each of a beam or column's analytical model curve
Transform transform = analyticalElem.GetTransform();
int index = spatialFieldManager.AddSpatialFieldPrimitive(curve, Transform.Identity);

IList<double> doubleList = new List<double>();
doubleList.Add(curve.GetEndParameter(0)); // vectors will be at each end of the analytical model curve
doubleList.Add(curve.GetEndParameter(1));
FieldDomainPointsByParameter pointsByParameter = new FieldDomainPointsByParameter(doubleList);

List<XYZ> xyzList = new List<XYZ>();
xyzList.Add(curve.ComputeDerivatives(0, true).BasisX.Normalize()); // vectors will be tangent to the curve at its ends
IList<VectorAtPoint> vectorList = new List<VectorAtPoint>();
vectorList.Add(new VectorAtPoint(xyzList));
xyzList.Clear();
xyzList.Add(curve.ComputeDerivatives(1, true).BasisX.Normalize().Negate());
vectorList.Add(new VectorAtPoint(xyzList));
FieldValues fieldValues = new FieldValues(vectorList);
```

 Copy  VB.NET

```
' Place analysis results in the form of vectors at each of a beam or column's analytical model curve
Dim analyticalModel As Autodesk.Revit.DB.Structure.AnalyticalElement = Nothing
Dim relManager As Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager = Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.GetAnalyticalToPhysicalAssociationManager(doc)

If (relManager Is Nothing) Then
   Exit Sub
End If

   Dim counterpartId As ElementId = relManager.GetAssociatedElementId(familyInstance.Id)
   If (counterpartId Is Nothing) Then
   Exit Sub
End If

analyticalModel = doc.GetElement(counterpartId)

Dim curve As Curve = analyticalModel.GetCurve()
Dim transform__1 As Transform = familyInstance.GetTransform()
   Dim index As Integer = spatialFieldManager.AddSpatialFieldPrimitive(curve, Transform.Identity)

   Dim doubleList As IList(Of Double) = New List(Of Double)()
   doubleList.Add(curve.GetEndParameter(0))
   ' vectors will be at each end of the analytical model curve
   doubleList.Add(curve.GetEndParameter(1))
   Dim pointsByParameter As New FieldDomainPointsByParameter(doubleList)

   Dim xyzList As New List(Of XYZ)()
   xyzList.Add(curve.ComputeDerivatives(0, True).BasisX.Normalize())
   ' vectors will be tangent to the curve at its ends
   Dim vectorList As IList(Of VectorAtPoint) = New List(Of VectorAtPoint)()
   vectorList.Add(New VectorAtPoint(xyzList))
   xyzList.Clear()
   xyzList.Add(curve.ComputeDerivatives(1, True).BasisX.Normalize().Negate())
   vectorList.Add(New VectorAtPoint(xyzList))
   Dim fieldValues As New FieldValues(vectorList)
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ValueAtPointBase
  Autodesk.Revit.DB.Analysis VectorAtPoint

# See Also

VectorAtPoint Members

Autodesk.Revit.DB.Analysis Namespace

#### FilterNumericLess Class

---

|  |
| --- |
| Members   See Also |

Tests whether numeric values from the document are less than a certain value

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public class FilterNumericLess : FilterNumericRuleEvaluator ``` |

| Visual Basic |
| --- |
| ``` Public Class FilterNumericLess _ 	Inherits FilterNumericRuleEvaluator ``` |

| Visual C++ |
| --- |
| ``` public ref class FilterNumericLess : public FilterNumericRuleEvaluator ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB FilterNumericRuleEvaluator
  Autodesk.Revit.DB FilterNumericLess

# See Also

FilterNumericLess Members

Autodesk.Revit.DB Namespace

#### OvalDuctSizeSeparator Property

---

|  |
| --- |
| DuctSettings Class   See Also |

The oval duct size separator string.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public string OvalDuctSizeSeparator { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property OvalDuctSizeSeparator As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ OvalDuctSizeSeparator { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

DuctSettings Class

Autodesk.Revit.DB.Mechanical Namespace

#### SetExportLineweightTable Method

---

|  |
| --- |
| DGNExportOptions Class   See Also |

Sets the line weight table to use during export.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void SetExportLineweightTable( 	ExportLineweightTable lineweightTable ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetExportLineweightTable ( _ 	lineweightTable As ExportLineweightTable _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetExportLineweightTable( 	ExportLineweightTable^ lineweightTable ) ``` |

#### Parameters

lineweightTable
:   Type:  Autodesk.Revit.DB ExportLineweightTable
     The line weight table to be set.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DGNExportOptions Class

Autodesk.Revit.DB Namespace

#### GetRodEndPosition Method

---

|  |
| --- |
| FabricationRodInfo Class   See Also |

Gets the position of the rod end.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public XYZ GetRodEndPosition( 	int rodIndex ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetRodEndPosition ( _ 	rodIndex As Integer _ ) As XYZ ``` |

| Visual C++ |
| --- |
| ``` public: XYZ^ GetRodEndPosition( 	int rodIndex ) ``` |

#### Parameters

rodIndex
:   Type:  System Int32
     The index of the rod.

#### Return Value

The position of the rod end.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | the index rodIndex is should be in range of rod count. |

# See Also

FabricationRodInfo Class

Autodesk.Revit.DB Namespace

#### AnalysisDisplayColoredSurfaceSettings Class

---

|  |
| --- |
| Members   Example   See Also |

Contains colored surface settings for analysis display style element.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public class AnalysisDisplayColoredSurfaceSettings : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class AnalysisDisplayColoredSurfaceSettings _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class AnalysisDisplayColoredSurfaceSettings : IDisposable ``` |

# Examples

 Copy  C#

```
AnalysisDisplayColoredSurfaceSettings coloredSurfaceSettings = new AnalysisDisplayColoredSurfaceSettings();
coloredSurfaceSettings.ShowGridLines = true;
```

 Copy  VB.NET

```
Dim coloredSurfaceSettings As New AnalysisDisplayColoredSurfaceSettings()
coloredSurfaceSettings.ShowGridLines = True
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Analysis AnalysisDisplayColoredSurfaceSettings

# See Also

AnalysisDisplayColoredSurfaceSettings Members

Autodesk.Revit.DB.Analysis Namespace

#### GetPoint Method

---

|  |
| --- |
| PolymeshTopology Class   See Also |

Returns one point at the given index.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public XYZ GetPoint( 	int idx ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetPoint ( _ 	idx As Integer _ ) As XYZ ``` |

| Visual C++ |
| --- |
| ``` public: XYZ^ GetPoint( 	int idx ) ``` |

#### Parameters

idx
:   Type:  System Int32
     A zero-based index of a polymesh point

#### Return Value

XYZ coordinates of the point

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given value is not a valid index of a point of the polymesh. A valid valure is not negative and is smaller than the number of points in the polymesh. |

# See Also

PolymeshTopology Class

Autodesk.Revit.DB Namespace

#### SolidCurveIntersectionOptions Class

---

|  |
| --- |
| Members   See Also |

This class contains the options used to calculate the intersection between a solid and a curve.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class SolidCurveIntersectionOptions : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class SolidCurveIntersectionOptions _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class SolidCurveIntersectionOptions : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB SolidCurveIntersectionOptions

# See Also

SolidCurveIntersectionOptions Members

Autodesk.Revit.DB Namespace

#### LegendTextTypeId Property

---

|  |
| --- |
| SpatialFieldManager Class   See Also |

Stores element id of text associated with common (result-independent) part of legend in view.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public ElementId LegendTextTypeId { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property LegendTextTypeId As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ LegendTextTypeId { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

SpatialFieldManager Class

Autodesk.Revit.DB.Analysis Namespace

#### BritishThermalUnitsPerPound Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

British thermal units per pound.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BritishThermalUnitsPerPound { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BritishThermalUnitsPerPound As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BritishThermalUnitsPerPound { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### Abbreviation Property

---

|  |
| --- |
| FabricationService Class   See Also |

The short name of service.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public string Abbreviation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Abbreviation As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ Abbreviation { 	String^ get (); } ``` |

# See Also

FabricationService Class

Autodesk.Revit.DB Namespace

#### RbsHvacloadRoofCoolingLoadParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Roof Cooling Load"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsHvacloadRoofCoolingLoadParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsHvacloadRoofCoolingLoadParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsHvacloadRoofCoolingLoadParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ElectricalCircuiting Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Electrical - Circuiting"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ElectricalCircuiting { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ElectricalCircuiting As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ElectricalCircuiting { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### NotEnoughRoomForParallelPipes Property

---

|  |
| --- |
| BuiltInFailures ElectricalFailures Class   See Also |

Due to changes in elevation, there is not enough room to generate all of the parallel pipes. As a result, some pipe segments have not been generated.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NotEnoughRoomForParallelPipes { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NotEnoughRoomForParallelPipes As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NotEnoughRoomForParallelPipes { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ElectricalFailures Class

Autodesk.Revit.DB Namespace

#### StructuralCamber Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Camber Size"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralCamber { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralCamber As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralCamber { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CouplerCoupledEndtreatment Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"End Treatment 2"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CouplerCoupledEndtreatment { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CouplerCoupledEndtreatment As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CouplerCoupledEndtreatment { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### LowerRange Property

---

|  |
| --- |
| ProgressChangedEventArgs Class   See Also |

Lower part of progress bar range - always zero

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public int LowerRange { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property LowerRange As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int LowerRange { 	int get (); } ``` |

# See Also

ProgressChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace

#### CurveParamSteelCantilever Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Steel Cantilever"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CurveParamSteelCantilever { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CurveParamSteelCantilever As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CurveParamSteelCantilever { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ArePartsValidForMerge Method

---

|  |
| --- |
| PartUtils Class   See Also |

Identifies whether Part elements may be merged.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static bool ArePartsValidForMerge( 	Document document, 	ICollection<ElementId> partIds ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function ArePartsValidForMerge ( _ 	document As Document, _ 	partIds As ICollection(Of ElementId) _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool ArePartsValidForMerge( 	Document^ document,  	ICollection<ElementId^>^ partIds ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

partIds
:   Type:  System.Collections.Generic ICollection   ElementId
     Element ids of Parts.

#### Return Value

True if all element ids correspond to Part elements, none of the parts already has associated parts, the parts have contiguous geometry, all report the same materials, and all have the same creation and demolition phases.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PartUtils Class

Autodesk.Revit.DB Namespace

#### ContinuousRailFilletCreationParallel Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Cannot create specified fillet at rail path corner because of the curves are already smoothed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ContinuousRailFilletCreationParallel { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ContinuousRailFilletCreationParallel As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ContinuousRailFilletCreationParallel { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### LoadClassification Property

---

|  |
| --- |
| AreaBasedLoadType Class   See Also |

The load classification of area based load type.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public ElementId LoadClassification { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property LoadClassification As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ LoadClassification { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The id is not a load classification id . |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

AreaBasedLoadType Class

Autodesk.Revit.DB.Electrical Namespace

#### MultiReferenceAnnotationTagType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Tag Family"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MultiReferenceAnnotationTagType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MultiReferenceAnnotationTagType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MultiReferenceAnnotationTagType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TemporaryChangesOutOfDate Property

---

|  |
| --- |
| BuiltInFailures EditingFailures Class   See Also |

You must Reload Latest before editing the element. Changes will be temporary, and will not be saved.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId TemporaryChangesOutOfDate { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TemporaryChangesOutOfDate As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ TemporaryChangesOutOfDate { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures EditingFailures Class

Autodesk.Revit.DB Namespace

#### MajorSegmentIndex Property

---

|  |
| --- |
| RebarShapeDefinitionBySegments Class   See Also |

Index of a segment that can be considered the most important. Revit attempts to preserve the orientation of this segment when a Rebar instance changes its RebarShape to one with a different number of segments.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public int MajorSegmentIndex { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property MajorSegmentIndex As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int MajorSegmentIndex { 	int get (); 	void set (int value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: majorSegmentIndex is not between 0 and NumberOfSegments. |

# See Also

RebarShapeDefinitionBySegments Class

Autodesk.Revit.DB.Structure Namespace

#### SetBoldStatus Method (TextRange, Boolean)

---

|  |
| --- |
| FormattedText Class   See Also |

Sets the characters in a given text range to be bold or not bold.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public void SetBoldStatus( 	TextRange textRange, 	bool isBold ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetBoldStatus ( _ 	textRange As TextRange, _ 	isBold As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetBoldStatus( 	TextRange^ textRange,  	bool isBold ) ``` |

#### Parameters

textRange
:   Type:  Autodesk.Revit.DB TextRange
     The given text range.

isBold
:   Type:  System Boolean
     The desired bold status of characters in the given text range. True to set bold, false to set not bold.

# Remarks

To make the numbers or letters in a list bold, apply the bold status to the carriage return character that ends the list paragraph.

The given text range should not be empty.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | This text range is empty. -or- This start index of this text range is not within the text range identifying the entire text. -or- The end of this text range is not within the text range identifying the entire text. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FormattedText Class

SetBoldStatus Overload

Autodesk.Revit.DB Namespace

#### CannotCopyDetails Property

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   See Also |

Can't copy some or all of the detailing with the view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCopyDetails { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCopyDetails As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCopyDetails { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| FabricationItemFile Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

FabricationItemFile Class

Autodesk.Revit.DB Namespace

#### RailingSystemFamilyTopRail Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Top Rail"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RailingSystemFamilyTopRail { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RailingSystemFamilyTopRail As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RailingSystemFamilyTopRail { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### WoodGrowthPerlinEnable Property

---

|  |
| --- |
| AdvancedWood Class   See Also |

The property labeled "Use perlin noise for ring growth" from the "AdvancedWood" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string WoodGrowthPerlinEnable { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WoodGrowthPerlinEnable As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ WoodGrowthPerlinEnable { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyBoolean".

# See Also

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace

#### GetFailureDefinitionId Method

---

|  |
| --- |
| FailureMessageAccessor Class   See Also |

Retrieves the Id of the FailureDefinition of the failure.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public FailureDefinitionId GetFailureDefinitionId() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetFailureDefinitionId As FailureDefinitionId ``` |

| Visual C++ |
| --- |
| ``` public: FailureDefinitionId^ GetFailureDefinitionId() ``` |

#### Return Value

The Id of the FailureDefinition of the failure.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | This FailureMessageAccessor has not been properly initialized. |

# See Also

FailureMessageAccessor Class

Autodesk.Revit.DB Namespace

#### FileExporting Event

---

|  |
| --- |
| Application Class   See Also |

Subscribe to the FileExporting event to be notified when Revit is just about to export files of formats supported by the API.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public event EventHandler<FileExportingEventArgs> FileExporting ``` |

| Visual Basic |
| --- |
| ``` Public Event FileExporting As EventHandler(Of FileExportingEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<FileExportingEventArgs^>^ FileExporting { 	void add (EventHandler<FileExportingEventArgs^>^ value); 	void remove (EventHandler<FileExportingEventArgs^>^ value); } ``` |

# Remarks

This event is raised when Revit is just about to export files of formats supported by the API.

Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.

Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True. Your application is responsible for providing feedback to the user about the reason for the cancellation.

The following API functions are not available for the current document during this event:

* All overloads of Autodesk.Revit.DB.Document.Export()
* Autodesk.Revit.Document.Print()
* Print  and similar overloads.
* SubmitPrint  and similar overloads.
* Close  and similar overloads.
* Save  .
* SaveAs(String)  and similar overloads.

Exception  InvalidOperationException  will be thrown if any of the above methods is called during this event.

Another  FileExported  event will be raised immediately after file exporting is finished.

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### GraphicDisplayOptionsBackground Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Background"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId GraphicDisplayOptionsBackground { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GraphicDisplayOptionsBackground As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ GraphicDisplayOptionsBackground { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ViewSolarstudyCurrentStudyTypeIndex Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Study type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ViewSolarstudyCurrentStudyTypeIndex { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewSolarstudyCurrentStudyTypeIndex As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ViewSolarstudyCurrentStudyTypeIndex { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetExportFontInfo Method

---

|  |
| --- |
| ExportFontTable Class   See Also |

Gets a copy of the font info associated to the input font key.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public ExportFontInfo GetExportFontInfo( 	ExportFontKey exportFontKey ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetExportFontInfo ( _ 	exportFontKey As ExportFontKey _ ) As ExportFontInfo ``` |

| Visual C++ |
| --- |
| ``` public: ExportFontInfo^ GetExportFontInfo( 	ExportFontKey^ exportFontKey ) ``` |

#### Parameters

exportFontKey
:   Type:  Autodesk.Revit.DB ExportFontKey
     The export font Key.

#### Return Value

Returns the fontInfo for this key.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | An entry with the given key is not present in the table. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExportFontTable Class

Autodesk.Revit.DB Namespace

#### AppendVertex Method

---

|  |
| --- |
| Wire Class   See Also |

Appends one vertex to the end of the wire.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public void AppendVertex( 	XYZ vertexPoint ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AppendVertex ( _ 	vertexPoint As XYZ _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AppendVertex( 	XYZ^ vertexPoint ) ``` |

#### Parameters

vertexPoint
:   Type:  Autodesk.Revit.DB XYZ
     The vertex to be appended.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The vertex point cannot be added to the wire because there is already a vertex at this position on the view plane (within tolerance). |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |
| Autodesk.Revit.Exceptions InvalidOperationException | The end point is already connected to an element, so a new endpoint vertex cannot be appended. |

# See Also

Wire Class

Autodesk.Revit.DB.Electrical Namespace

#### NoAutoRouteSolutionFoundWarning Property

---

|  |
| --- |
| BuiltInFailures AutoRouteFailures Class   See Also |

No auto-route solution was found.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NoAutoRouteSolutionFoundWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NoAutoRouteSolutionFoundWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NoAutoRouteSolutionFoundWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures AutoRouteFailures Class

Autodesk.Revit.DB Namespace

#### Add Method

---

|  |
| --- |
| ExportLayerTable Class   See Also |

Inserts a (key,info) pair into Export layer table.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void Add( 	ExportLayerKey exportLayerKey, 	ExportLayerInfo exportLayerInfo ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub Add ( _ 	exportLayerKey As ExportLayerKey, _ 	exportLayerInfo As ExportLayerInfo _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void Add( 	ExportLayerKey^ exportLayerKey,  	ExportLayerInfo^ exportLayerInfo ) ``` |

#### Parameters

exportLayerKey
:   Type:  Autodesk.Revit.DB ExportLayerKey
     The export layer key to be added.

exportLayerInfo
:   Type:  Autodesk.Revit.DB ExportLayerInfo
     The export layer info to be added.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The key already exists in the table. -or- The layer info does not contain the Category as a modifier type. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExportLayerTable Class

Autodesk.Revit.DB Namespace

#### GetSpecTypeId Method

---

|  |
| --- |
| FamilySizeTableColumn Class   See Also |

Gets the identifier of the spec describing values in the column.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public ForgeTypeId GetSpecTypeId() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSpecTypeId As ForgeTypeId ``` |

| Visual C++ |
| --- |
| ``` public: ForgeTypeId^ GetSpecTypeId() ``` |

#### Return Value

Identifier of the spec.

# See Also

FamilySizeTableColumn Class

Autodesk.Revit.DB Namespace

#### SpotElevationMissesReference Property

---

|  |
| --- |
| BuiltInFailures DimensionFailures Class   See Also |

Spot Dimension does not lie on its reference.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SpotElevationMissesReference { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpotElevationMissesReference As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SpotElevationMissesReference { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DimensionFailures Class

Autodesk.Revit.DB Namespace

#### IsMasking Property

---

|  |
| --- |
| FilledRegionType Class   See Also |

If true then the FilledRegion will cover the lines and edges of objects behind it. If false then lines and edges will remain visible.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public bool IsMasking { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property IsMasking As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsMasking { 	bool get (); 	void set (bool value); } ``` |

# See Also

FilledRegionType Class

Autodesk.Revit.DB Namespace

#### Clear Method

---

|  |
| --- |
| ReferencePointArray Class   See Also |

Removes every reference from the array, rendering it empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Clear() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Clear ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Clear() ``` |

# See Also

ReferencePointArray Class

Autodesk.Revit.DB Namespace

#### DepthDimensionNotExisted Property

---

|  |
| --- |
| BuiltInFailures RebarShapeFailures Class   See Also |

Multi-planar shape's depth dimension has been deleted. Please assign a new one to multi-planar depth.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DepthDimensionNotExisted { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DepthDimensionNotExisted As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DepthDimensionNotExisted { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarShapeFailures Class

Autodesk.Revit.DB Namespace

#### FamilyIsCorruptError Property

---

|  |
| --- |
| BuiltInFailures FamilyFailures Class   See Also |

Some families have become unusable. Reload the families, or delete them from the model.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FamilyIsCorruptError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FamilyIsCorruptError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FamilyIsCorruptError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FamilyFailures Class

Autodesk.Revit.DB Namespace

#### PipingNetwork Property

---

|  |
| --- |
| PipingSystem Class   See Also |

Pipes and fittings which are contained in this system.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ElementSet PipingNetwork { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property PipingNetwork As ElementSet 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementSet^ PipingNetwork { 	ElementSet^ get (); } ``` |

# Remarks

The return value doesn't include mechanical equipment elements. The pipes and fittings are not returned in any particular order.

# See Also

PipingSystem Class

Autodesk.Revit.DB.Plumbing Namespace

#### AreVertexPointsValid Method

---

|  |
| --- |
| Wire Class   See Also |

Checks if the given vertex points are valid for the wire.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public static bool AreVertexPointsValid( 	IList<XYZ> vertexPoints, 	Connector startConnector, 	Connector endConnector ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function AreVertexPointsValid ( _ 	vertexPoints As IList(Of XYZ), _ 	startConnector As Connector, _ 	endConnector As Connector _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool AreVertexPointsValid( 	IList<XYZ^>^ vertexPoints,  	Connector^ startConnector,  	Connector^ endConnector ) ``` |

#### Parameters

vertexPoints
:   Type:  System.Collections.Generic IList   XYZ
     The vertex points.

startConnector
:   Type:  Autodesk.Revit.DB Connector
     The start connector of the wire.

endConnector
:   Type:  Autodesk.Revit.DB Connector
     The end connector of the wire.

#### Return Value

True if the given vertex points are valid, false otherwise.

# Remarks

X and Y values are compared of the vertices.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

Wire Class

Autodesk.Revit.DB.Electrical Namespace

#### SlabEdgeType Property

---

|  |
| --- |
| SlabEdge Class   See Also |

Retrieves/set an object that represents the type of the SlabEdge.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public SlabEdgeType SlabEdgeType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SlabEdgeType As SlabEdgeType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property SlabEdgeType^ SlabEdgeType { 	SlabEdgeType^ get (); 	void set (SlabEdgeType^ value); } ``` |

# See Also

SlabEdge Class

Autodesk.Revit.DB Namespace

#### DivisionRuleId Property

---

|  |
| --- |
| PartMakerMethodToDivideVolumes Class   See Also |

Id of the 'DivisionRule' which is used to augment the cutting sketch.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ElementId DivisionRuleId { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property DivisionRuleId As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ DivisionRuleId { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The provided element id cannot be assigned as a division rule to this PartMakerMethodToDivideVolumes. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

PartMakerMethodToDivideVolumes Class

Autodesk.Revit.DB Namespace

#### Export Method (String, String, ICollection(ElementId), DXFExportOptions)

---

|  |
| --- |
| Document Class   See Also |

Exports a selection of views in DXF format.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public bool Export( 	string folder, 	string name, 	ICollection<ElementId> views, 	DXFExportOptions options ) ``` |

| Visual Basic |
| --- |
| ``` Public Function Export ( _ 	folder As String, _ 	name As String, _ 	views As ICollection(Of ElementId), _ 	options As DXFExportOptions _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool Export( 	String^ folder,  	String^ name,  	ICollection<ElementId^>^ views,  	DXFExportOptions^ options ) ``` |

#### Parameters

folder
:   Type:  System String
     Output folder, into which file(s) will be exported. The folder must exist.

name
:   Type:  System String
     Either the name of a single file or a prefix for a set of files. If empty, automatic naming will be used.

views
:   Type:  System.Collections.Generic ICollection   ElementId
     Selection of views to be exported. The set must contain at least one valid view.

options
:   Type:  Autodesk.Revit.DB DXFExportOptions
     Various options applicable to the DXF format. If    a null reference (  Nothing  in Visual Basic)  , all options will be set to their respective default values.

#### Return Value

True if successful, otherwise False.

# Remarks

All the views must be printable for the Export to succeed. It can be assured by checking the CanBePrinted property of each view.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | NullOrEmpty -or- Contains invalid characters. -or- non empty list of views must be provided. -or- some of the views are not printable (exportable). -or- Thrown when the options in DWGExportOptions is invalid. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions DirectoryNotFoundException | Thrown when the directory does not exist. |
| Autodesk.Revit.Exceptions InvalidOperationException | Export is temporarily disabled. -or- Exporting is not allowed in the current application mode. |
| Autodesk.Revit.Exceptions InvalidPathArgumentException | The folder does not exist. |
| Autodesk.Revit.Exceptions OptionalFunctionalityNotAvailableException | The DXF module is not available in the installed Revit. -or- The Graphics module is not available in the installed Revit. |

# See Also

Document Class

Export Overload

Autodesk.Revit.DB Namespace

#### BuiltInFailures.NumberingFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures related to object numbering operations.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class NumberingFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class NumberingFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class NumberingFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures NumberingFailures

# See Also

BuiltInFailures NumberingFailures Members

Autodesk.Revit.DB Namespace

#### Suffix Property

---

|  |
| --- |
| TableCellCombinedParameterData Class   See Also |

The suffix for this parameter

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public string Suffix { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Suffix As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ Suffix { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

TableCellCombinedParameterData Class

Autodesk.Revit.DB Namespace

#### Shininess Property

---

|  |
| --- |
| Material Class   See Also |

The shininess of the material.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public int Shininess { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Shininess As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int Shininess { 	int get (); 	void set (int value); } ``` |

#### Field Value

The value ranges from 0 to 128.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: values for shininess must be between 0 and 128 |

# See Also

Material Class

Autodesk.Revit.DB Namespace

#### SetAttribute Method (String, IList(Boolean))

---

|  |
| --- |
| IFCAnyHandle Class   See Also |

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetAttribute( 	string name, 	IList<bool> values ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetAttribute ( _ 	name As String, _ 	values As IList(Of Boolean) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetAttribute( 	String^ name,  	IList<bool>^ values ) ``` |

#### Parameters

name
:   Type:  System String

values
:   Type:  System.Collections.Generic IList   Boolean

# See Also

IFCAnyHandle Class

SetAttribute Overload

Autodesk.Revit.DB.IFC Namespace

#### IsValidObject Property

---

|  |
| --- |
| DuctFittingAndAccessoryData Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

DuctFittingAndAccessoryData Class

Autodesk.Revit.DB.Mechanical Namespace

#### GetLoadClassificationDemandCurrent Method

---

|  |
| --- |
| PanelScheduleView Class   See Also |

Gets the Demand Current for given Load Classification

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public string GetLoadClassificationDemandCurrent( 	int nRow, 	int nCol ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetLoadClassificationDemandCurrent ( _ 	nRow As Integer, _ 	nCol As Integer _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: String^ GetLoadClassificationDemandCurrent( 	int nRow,  	int nCol ) ``` |

#### Parameters

nRow
:   Type:  System Int32
     Row number of Load Summary Section

nCol
:   Type:  System Int32
     Column number of Load Summary Section

#### Return Value

The Demand Current for the given Load Classification

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | The given row number nRow is invalid in Summary. -or- The given column number nCol is invalid in Summary. |

# See Also

PanelScheduleView Class

Autodesk.Revit.DB.Electrical Namespace

#### PlacementFailed Property

---

|  |
| --- |
| BuiltInFailures EditingFailures Class   See Also |

Failed to place component.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId PlacementFailed { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PlacementFailed As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ PlacementFailed { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures EditingFailures Class

Autodesk.Revit.DB Namespace

#### ReverseIterator Method

---

|  |
| --- |
| GeomCombinationSet Class   See Also |

Retrieve a backward moving iterator to the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual GeomCombinationSetIterator ReverseIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ReverseIterator As GeomCombinationSetIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual GeomCombinationSetIterator^ ReverseIterator() ``` |

#### Return Value

Returns a backward moving iterator to the set.

# See Also

GeomCombinationSet Class

Autodesk.Revit.DB Namespace

#### AssignElementsToSequence Method

---

|  |
| --- |
| NumberingSchema Class   See Also |

Assigns the input elements to a sequence identified by the given partition name.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public void AssignElementsToSequence( 	ISet<ElementId> elementIds, 	string partitionName ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AssignElementsToSequence ( _ 	elementIds As ISet(Of ElementId), _ 	partitionName As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AssignElementsToSequence( 	ISet<ElementId^>^ elementIds,  	String^ partitionName ) ``` |

#### Parameters

elementIds
:   Type:  System.Collections.Generic ISet   ElementId
     Ids of elements which are to be added to a sequence. All elements must be valid and belonging to this schema.

partitionName
:   Type:  System String
     Name of the target sequence's partition

# Remarks

Elements will be added to the sequence by changing the value of their Partition parameter. The difference between this method and changing the parameter value explicitly is that the method here causes sequences to get assigned and renumbered automatically and immediately without needing to commit a transaction first.

A numbering sequence for the given partition does not need to exist yet; it will get created automatically by this method as needed.

The elements' numbers are likely to be affected by this operation, which is to be expected. The values of assigned numbers will depend on whether the given sequence already exists or not. In both cases the elements will get renumbered in order of their original creation, but the first value will be 1 if the sequence does not exist yet, respectively the next highest number if the sequence does exist already. The general matching policy is always applied causing matched elements to have the same number.

A special case is considered when the given elements are all the elements of one sequence and are being assigned to a sequence that does not exist yet. Such an operation is identical in effect to the  MoveSequence  method and all the elements will keep their numbers unchanged.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | the given partitionName cannot be used as a valid name of a numbering partition because it contains characters that are considered invalid, such as non-printable characters or those that cannot be used in a file's name. -or- Thrown when elementIds contains Ids that are either invalid or of elements not from this schema. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Either the schema or its document cannot be modified at present. -or- Thrown if there is an element that cannot have new value of the NUMBER\_PARTITION\_PARAM parameter assigned. It may be an indication that the element is not free to be edited at present. |

# See Also

NumberingSchema Class

Autodesk.Revit.DB Namespace

#### DividedSurfacePointNumber Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Point number"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DividedSurfacePointNumber { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DividedSurfacePointNumber As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DividedSurfacePointNumber { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Flexible Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Adaptive Component"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Flexible { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Flexible As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Flexible { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### SetBuildingConstruction Method

---

|  |
| --- |
| MEPBuildingConstruction Class   See Also |

Sets the Building Construction of the Project Information.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetBuildingConstruction( 	ConstructionType constructionType, 	Construction buildingConstruction ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetBuildingConstruction ( _ 	constructionType As ConstructionType, _ 	buildingConstruction As Construction _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetBuildingConstruction( 	ConstructionType constructionType,  	Construction^ buildingConstruction ) ``` |

#### Parameters

constructionType
:   Type:  Autodesk.Revit.DB.Analysis ConstructionType
     The Construction Type of Building Construction.

buildingConstruction
:   Type:  Autodesk.Revit.DB Construction
     The Building Construction to be set.

# Remarks

This function is used to set the Building Construction of the Project Information.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | buildingConstruction is NULL. |
| Autodesk.Revit.Exceptions InvalidOperationException | Sets construction type to an invalid value. - or - Can not set construction type. |

# See Also

MEPBuildingConstruction Class

Autodesk.Revit.DB.Mechanical Namespace

#### LightGroup Class

---

|  |
| --- |
| Members   Example   See Also |

This class represents a set of lights grouped together for easier management of various lighting scenarios

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class LightGroup : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class LightGroup _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class LightGroup : IDisposable ``` |

# Examples

 Copy  C#

```
public void AddRemoveLightInGroup(LightGroup groupOne, LightGroup groupTwo, FamilyInstance lightOne, FamilyInstance lightTwo)
{
    // Add two lights into groupOne.
    groupOne.AddLight(lightOne.Id);
    groupOne.AddLight(lightTwo.Id);

    // Move a light from groupOne to groupTwo
    groupTwo.AddLight(lightOne.Id);

    // Retrieve the added lights in the group
    ICollection<ElementId> existingLightIds = groupOne.GetLights();

    // remove the light
    groupOne.RemoveLight(lightTwo.Id);
}
```

 Copy  VB.NET

```
Public Sub AddRemoveLightInGroup(groupOne As LightGroup, groupTwo As LightGroup, lightOne As FamilyInstance, lightTwo As FamilyInstance)
    ' Add two lights into groupOne.
    groupOne.AddLight(lightOne.Id)
    groupOne.AddLight(lightTwo.Id)

    ' Move a light from groupOne to groupTwo
    groupTwo.AddLight(lightOne.Id)

    ' Retrieve the added lights in the group
    Dim existingLightIds As ICollection(Of ElementId) = groupOne.GetLights()

    ' remove the light
    groupOne.RemoveLight(lightTwo.Id)
End Sub
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Lighting LightGroup

# See Also

LightGroup Members

Autodesk.Revit.DB.Lighting Namespace

#### MullionProfileContainsMoreThanOneOrOpenLoop Property

---

|  |
| --- |
| BuiltInFailures CurtainGridFamilyFailures Class   See Also |

The selected mullion profile either contains more than one profile loop or an open profile loop and cannot be used. Valid profiles can only have a single continuous closed profile loop.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId MullionProfileContainsMoreThanOneOrOpenLoop { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MullionProfileContainsMoreThanOneOrOpenLoop As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ MullionProfileContainsMoreThanOneOrOpenLoop { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CurtainGridFamilyFailures Class

Autodesk.Revit.DB Namespace

#### VisibilityType Property

---

|  |
| --- |
| FamilyElementVisibility Class   See Also |

Indicates if the instance is Model or View specific.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FamilyElementVisibilityType VisibilityType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property VisibilityType As FamilyElementVisibilityType 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property FamilyElementVisibilityType VisibilityType { 	FamilyElementVisibilityType get (); } ``` |

# See Also

FamilyElementVisibility Class

Autodesk.Revit.DB Namespace

#### GetFirstProfileCurve Method

---

|  |
| --- |
| RuledSurface Class   See Also |

Returns a copy of the first profile curve if it is set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public Curve GetFirstProfileCurve() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetFirstProfileCurve As Curve ``` |

| Visual C++ |
| --- |
| ``` public: Curve^ GetFirstProfileCurve() ``` |

#### Return Value

A copy of the first profile curve, if it exists. If a point was used to define the first profile, this function will return    a null reference (  Nothing  in Visual Basic)  .

# See Also

RuledSurface Class

Autodesk.Revit.DB Namespace

#### CoolingLoadDividedByArea Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Cooling Load divided by Area, in discipline HVAC.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CoolingLoadDividedByArea { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CoolingLoadDividedByArea As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CoolingLoadDividedByArea { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| BuildingEnvelopeAnalyzerOptions Class   See Also |

Releases all resources used by the  BuildingEnvelopeAnalyzerOptions

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

BuildingEnvelopeAnalyzerOptions Class

Autodesk.Revit.DB.Analysis Namespace

#### StoneBumpMap Property

---

|  |
| --- |
| Stone Class   See Also |

The property labeled "Image" from the "Stone" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string StoneBumpMap { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StoneBumpMap As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ StoneBumpMap { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.

# See Also

Stone Class

Autodesk.Revit.DB.Visual Namespace

#### NoRoofsSpacesBoundingWarn Property

---

|  |
| --- |
| BuiltInFailures EnergyAnalysisFailures Class   See Also |

The energy analysis model does not contain any roof surfaces! If there are roofs in your model, please verify that they are space bounding, and make sure that the space offsets are high enough to include the roofs.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NoRoofsSpacesBoundingWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NoRoofsSpacesBoundingWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NoRoofsSpacesBoundingWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures EnergyAnalysisFailures Class

Autodesk.Revit.DB Namespace

#### DivisionContainsNoReferences Property

---

|  |
| --- |
| BuiltInFailures DPartFailures Class   See Also |

The division contains no dividing references.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DivisionContainsNoReferences { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DivisionContainsNoReferences As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DivisionContainsNoReferences { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DPartFailures Class

Autodesk.Revit.DB Namespace

#### NumberSystemDisplayRule Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Display Rule"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId NumberSystemDisplayRule { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NumberSystemDisplayRule As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ NumberSystemDisplayRule { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### NumberSystemOrientation Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Orientation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId NumberSystemOrientation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NumberSystemOrientation As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ NumberSystemOrientation { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetValueAsDoubles Method

---

|  |
| --- |
| AssetPropertyDoubleArray4d Class   See Also |

Gets the value property as doubles.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public IList<double> GetValueAsDoubles() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetValueAsDoubles As IList(Of Double) ``` |

| Visual C++ |
| --- |
| ``` public: IList<double>^ GetValueAsDoubles() ``` |

#### Return Value

The value as doubles.

# See Also

AssetPropertyDoubleArray4d Class

Autodesk.Revit.DB.Visual Namespace

#### FamilyInstanceIsNotCuttingHost Property

---

|  |
| --- |
| BuiltInFailures InfillFailures Class   See Also |

Instance is not cutting host.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FamilyInstanceIsNotCuttingHost { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FamilyInstanceIsNotCuttingHost As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FamilyInstanceIsNotCuttingHost { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures InfillFailures Class

Autodesk.Revit.DB Namespace

#### GetProfileCurveInWorldCoordinates Method

---

|  |
| --- |
| RevolvedSurface Class   See Also |

Returns a copy of the profile curve expressed in the world coordinate system.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017\_subscription\_update

# Syntax

| C# |
| --- |
| ``` public Curve GetProfileCurveInWorldCoordinates() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetProfileCurveInWorldCoordinates As Curve ``` |

| Visual C++ |
| --- |
| ``` public: Curve^ GetProfileCurveInWorldCoordinates() ``` |

#### Return Value

A copy of the profile curve in the world coordinate system.

# See Also

RevolvedSurface Class

Autodesk.Revit.DB Namespace

#### CannotKeepTrussJoined Property

---

|  |
| --- |
| BuiltInFailures JoinElementsFailures Class   See Also |

Can't keep the highlighted [Element]s joined.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotKeepTrussJoined { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotKeepTrussJoined As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotKeepTrussJoined { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures JoinElementsFailures Class

Autodesk.Revit.DB Namespace

#### OrderedViewList Property

---

|  |
| --- |
| IViewSheetSet Interface   See Also |

Ordered views.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` IReadOnlyList<View> OrderedViewList { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Property OrderedViewList As IReadOnlyList(Of View) 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` property IReadOnlyList<View^>^ OrderedViewList { 	IReadOnlyList<View^>^ get (); 	void set (IReadOnlyList<View^>^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the input ordered view list is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the set operation failed due to invalid view which cannot be printed. |

# See Also

IViewSheetSet Interface

Autodesk.Revit.DB Namespace

#### EndParameter Property

---

|  |
| --- |
| PolylineSegments Class   See Also |

Parameter associated with the end point.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public double EndParameter { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property EndParameter As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double EndParameter { 	double get (); } ``` |

# See Also

PolylineSegments Class

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| ColorFillLegend Class   See Also |

Creates new instance of ColorFillLegend.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public static ColorFillLegend Create( 	Document document, 	ElementId viewId, 	ElementId catetoryId, 	XYZ origin ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	viewId As ElementId, _ 	catetoryId As ElementId, _ 	origin As XYZ _ ) As ColorFillLegend ``` |

| Visual C++ |
| --- |
| ``` public: static ColorFillLegend^ Create( 	Document^ document,  	ElementId^ viewId,  	ElementId^ catetoryId,  	XYZ^ origin ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

viewId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the view to place legend in.

catetoryId
:   Type:  Autodesk.Revit.DB ElementId
     The id of category that color fill scheme belongs to.

origin
:   Type:  Autodesk.Revit.DB XYZ
     The origin point of the legend, must be on the view plane.

# Remarks

Use  SupportedColorFillCategoryIds  to get list of supported categories.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | document is not a project document. -or- There's no valid color fill scheme applied for catetoryId in viewId. -or- The origin is not on the view plane. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

ColorFillLegend Class

Autodesk.Revit.DB Namespace

#### RoomHeightNegative Property

---

|  |
| --- |
| BuiltInFailures RoomFailures Class   See Also |

[Room] must have a height greater than 0.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RoomHeightNegative { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoomHeightNegative As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RoomHeightNegative { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RoomFailures Class

Autodesk.Revit.DB Namespace

#### BuiltInFailures.LevelFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures about Level.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class LevelFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class LevelFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class LevelFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures LevelFailures

# See Also

BuiltInFailures LevelFailures Members

Autodesk.Revit.DB Namespace

#### CylindricalHelix Class

---

|  |
| --- |
| Members   See Also |

A cylindrical helix.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class CylindricalHelix : Curve ``` |

| Visual Basic |
| --- |
| ``` Public Class CylindricalHelix _ 	Inherits Curve ``` |

| Visual C++ |
| --- |
| ``` public ref class CylindricalHelix : public Curve ``` |

# Remarks

The helix winds around a cylinder making constant angle with the axis of the cylinder. In this release, CylindricalHelix curves are used only in specific applications in stairs and railings, and should not be used or encountered when accessing curves of other Revit elements and geometry.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB GeometryObject
  Autodesk.Revit.DB Curve
  Autodesk.Revit.DB CylindricalHelix

# See Also

CylindricalHelix Members

Autodesk.Revit.DB Namespace

#### LightingSource Enumeration

---

|  |
| --- |
| See Also |

Indicates the lighting scheme type in rendering settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum LightingSource ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration LightingSource ``` |

| Visual C++ |
| --- |
| ``` public enum class LightingSource ``` |

# Members

| Member name | Description |
| --- | --- |
| ExteriorSun | Exterior source of light, sun only. |
| ExteriorSunAndArtificial | Exterior source of light, sun and artificial light. |
| ExteriorArtificial | Exterior source of light, artificial light only. |
| InteriorSun | Interior source of light, sun only. |
| InteriorSunAndArtificial | Interior source of light, sun and artificial light. |
| InteriorArtificial | Interior source of light, artificial light only. |

# See Also

Autodesk.Revit.DB Namespace

#### SpiralRunRadiusTooSmallFailure Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

The radius value for the run is too small.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SpiralRunRadiusTooSmallFailure { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpiralRunRadiusTooSmallFailure As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SpiralRunRadiusTooSmallFailure { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### CantChangeParamMirror Property

---

|  |
| --- |
| BuiltInFailures PointFailures Class   See Also |

Can't mirror Element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CantChangeParamMirror { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CantChangeParamMirror As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CantChangeParamMirror { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures PointFailures Class

Autodesk.Revit.DB Namespace

#### StructuralSectionIWideFlange Constructor

---

|  |
| --- |
| StructuralSectionIWideFlange Class   See Also |

Creates a new instance of Structural Section I Wide Flange shape with the associated set of parameters, used to attach to structural element.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public StructuralSectionIWideFlange( 	double width, 	double height, 	double flangeThickness, 	double webThickness, 	double webFillet, 	double centroidHorizontal, 	double centroidVertical, 	double principalAxesAngle, 	double sectionArea, 	double perimeter, 	double nominalWeight, 	double momentOfInertiaStrongAxis, 	double momentOfInertiaWeakAxis, 	double elasticModulusStrongAxis, 	double elasticModulusWeakAxis, 	double plasticModulusStrongAxis, 	double plasticModulusWeakAxis, 	double torsionalMomentOfInertia, 	double torsionalModulus, 	double warpingConstant, 	double shearAreaStrongAxis, 	double shearAreaWeakAxis, 	double clearWebHeight, 	double flangeToeOfFillet, 	double webToeOfFillet, 	double boltSpacing, 	double boltSpacingTwoRows, 	double boltSpacingBetweenRows, 	double boltDiameter ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	width As Double, _ 	height As Double, _ 	flangeThickness As Double, _ 	webThickness As Double, _ 	webFillet As Double, _ 	centroidHorizontal As Double, _ 	centroidVertical As Double, _ 	principalAxesAngle As Double, _ 	sectionArea As Double, _ 	perimeter As Double, _ 	nominalWeight As Double, _ 	momentOfInertiaStrongAxis As Double, _ 	momentOfInertiaWeakAxis As Double, _ 	elasticModulusStrongAxis As Double, _ 	elasticModulusWeakAxis As Double, _ 	plasticModulusStrongAxis As Double, _ 	plasticModulusWeakAxis As Double, _ 	torsionalMomentOfInertia As Double, _ 	torsionalModulus As Double, _ 	warpingConstant As Double, _ 	shearAreaStrongAxis As Double, _ 	shearAreaWeakAxis As Double, _ 	clearWebHeight As Double, _ 	flangeToeOfFillet As Double, _ 	webToeOfFillet As Double, _ 	boltSpacing As Double, _ 	boltSpacingTwoRows As Double, _ 	boltSpacingBetweenRows As Double, _ 	boltDiameter As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: StructuralSectionIWideFlange( 	double width,  	double height,  	double flangeThickness,  	double webThickness,  	double webFillet,  	double centroidHorizontal,  	double centroidVertical,  	double principalAxesAngle,  	double sectionArea,  	double perimeter,  	double nominalWeight,  	double momentOfInertiaStrongAxis,  	double momentOfInertiaWeakAxis,  	double elasticModulusStrongAxis,  	double elasticModulusWeakAxis,  	double plasticModulusStrongAxis,  	double plasticModulusWeakAxis,  	double torsionalMomentOfInertia,  	double torsionalModulus,  	double warpingConstant,  	double shearAreaStrongAxis,  	double shearAreaWeakAxis,  	double clearWebHeight,  	double flangeToeOfFillet,  	double webToeOfFillet,  	double boltSpacing,  	double boltSpacingTwoRows,  	double boltSpacingBetweenRows,  	double boltDiameter ) ``` |

#### Parameters

width
:   Type:  System Double
     Section width.

height
:   Type:  System Double
     Section height, depth.

flangeThickness
:   Type:  System Double
     Flange Thickness.

webThickness
:   Type:  System Double
     Web Thickness.

webFillet
:   Type:  System Double
     Web Fillet - fillet radius between web and flange.

centroidHorizontal
:   Type:  System Double
     Distance from centroid to the left extremites along horizontal axis.

centroidVertical
:   Type:  System Double
     Distance from centroid to the upper extremites along vertical axis.

principalAxesAngle
:   Type:  System Double
     Rotation angle between the principal axes and cross section reference planes.

sectionArea
:   Type:  System Double
     Cross section area.

perimeter
:   Type:  System Double
     Painting surface of the unit length.

nominalWeight
:   Type:  System Double
     Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.

momentOfInertiaStrongAxis
:   Type:  System Double
     Moment of Inertia about main strong axis (I).

momentOfInertiaWeakAxis
:   Type:  System Double
     Moment of Inertia about main weak axis (I).

elasticModulusStrongAxis
:   Type:  System Double
     Elastic section modulus about main strong axis for calculation of bending stresses.

elasticModulusWeakAxis
:   Type:  System Double
     Elastic section modulus about main weak axis for calculation of bending stresses.

plasticModulusStrongAxis
:   Type:  System Double
     Plastic section modulus in bending about main strong axis (Z, Wpl)

plasticModulusWeakAxis
:   Type:  System Double
     Plastic section modulus in bending about main weak axis.

torsionalMomentOfInertia
:   Type:  System Double
     Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation

torsionalModulus
:   Type:  System Double
     Section modulus for calculations of torsion stresses (Ct)

warpingConstant
:   Type:  System Double
     Warping constant (Cw, Iomega, H)

shearAreaStrongAxis
:   Type:  System Double
     Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).

shearAreaWeakAxis
:   Type:  System Double
     Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).

clearWebHeight
:   Type:  System Double
     Detailing depth between the web toes of the fillets, in.(mm)

flangeToeOfFillet
:   Type:  System Double
     Detailing distance from center of web to flange toe of fillet, in. (mm)

webToeOfFillet
:   Type:  System Double
     Detailing distance from outer face of flange to web toe of fillet, in. (mm)

boltSpacing
:   Type:  System Double
     Standard bolt spacing, in. (mm)

boltSpacingTwoRows
:   Type:  System Double
     Standard bolt spacing for two rows , in. (mm)

boltSpacingBetweenRows
:   Type:  System Double
     Standard bolt spacing between rows, in. (mm)

boltDiameter
:   Type:  System Double
     Maximum bolt hole diameter, in. (mm)

# See Also

StructuralSectionIWideFlange Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### ShadowIntensity Property

---

|  |
| --- |
| View Class   See Also |

The intesity of cast shadows - 0 = no shadows, 100 = black.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public int ShadowIntensity { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ShadowIntensity As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int ShadowIntensity { 	int get (); 	void set (int value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The value is invalid. The valid range is 0 through 100 |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: This view does not contain display-related properties. |

# See Also

View Class

Autodesk.Revit.DB Namespace

#### GetCircuitNamingSchemeSettings Method

---

|  |
| --- |
| CircuitNamingSchemeSettings Class   See Also |

Gets the circuit naming scheme settings of the project.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static CircuitNamingSchemeSettings GetCircuitNamingSchemeSettings( 	Document cda ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetCircuitNamingSchemeSettings ( _ 	cda As Document _ ) As CircuitNamingSchemeSettings ``` |

| Visual C++ |
| --- |
| ``` public: static CircuitNamingSchemeSettings^ GetCircuitNamingSchemeSettings( 	Document^ cda ) ``` |

#### Parameters

cda
:   Type:  Autodesk.Revit.DB Document
     The document.

#### Return Value

The circuit naming scheme settings of the project.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

CircuitNamingSchemeSettings Class

Autodesk.Revit.DB.Electrical Namespace

#### CannotJoinElements Property

---

|  |
| --- |
| BuiltInFailures JoinElementsFailures Class   See Also |

Can't keep elements joined.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotJoinElements { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotJoinElements As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotJoinElements { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures JoinElementsFailures Class

Autodesk.Revit.DB Namespace

#### GetRelinquishedElements Method

---

|  |
| --- |
| RelinquishedItems Class   See Also |

The elements that were relinquished by the current user.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public ICollection<ElementId> GetRelinquishedElements() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetRelinquishedElements As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: ICollection<ElementId^>^ GetRelinquishedElements() ``` |

# See Also

RelinquishedItems Class

Autodesk.Revit.DB Namespace

#### CannotDrawStairsError Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Can't make stairs

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotDrawStairsError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotDrawStairsError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotDrawStairsError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### IsInUse Property

---

|  |
| --- |
| VoltageType Class   See Also |

Indicates whether this voltage type is in service now, such as by other distribution system.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsInUse { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsInUse As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsInUse { 	bool get (); } ``` |

# See Also

VoltageType Class

Autodesk.Revit.DB.Electrical Namespace

#### Reference Constructor

---

|  |
| --- |
| Reference Class   See Also |

Creates a Reference with the supplied element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public Reference( 	Element element ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	element As Element _ ) ``` |

| Visual C++ |
| --- |
| ``` public: Reference( 	Element^ element ) ``` |

#### Parameters

element
:   Type:  Autodesk.Revit.DB Element
     The element to create a reference.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the parameter is    a null reference (  Nothing  in Visual Basic)  . |

# See Also

Reference Class

Autodesk.Revit.DB Namespace

#### GetBarGeometry Method

---

|  |
| --- |
| RebarUpdateCurvesData Class   See Also |

Returns the geometry for a bar at the specified index currently in the Rebar.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public IList<Curve> GetBarGeometry( 	int barIndex ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetBarGeometry ( _ 	barIndex As Integer _ ) As IList(Of Curve) ``` |

| Visual C++ |
| --- |
| ``` public: IList<Curve^>^ GetBarGeometry( 	int barIndex ) ``` |

#### Parameters

barIndex
:   Type:  System Int32
     The index of the bar. Should be a number between 0 and GetNumberOfBars() - 1.

#### Return Value

Returns an array of curves that defines the bar at the specified index.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | barIndex is not in the range [ 0, GetNumberOfBars()-1 ]. |

# See Also

RebarUpdateCurvesData Class

Autodesk.Revit.DB.Structure Namespace

#### CanBeAssociatedWithGlobalParameters Method

---

|  |
| --- |
| Parameter Class   See Also |

Tests whether this parameter can be associated with any global parameter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016 Subscription Update

# Syntax

| C# |
| --- |
| ``` public bool CanBeAssociatedWithGlobalParameters() ``` |

| Visual Basic |
| --- |
| ``` Public Function CanBeAssociatedWithGlobalParameters As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CanBeAssociatedWithGlobalParameters() ``` |

#### Return Value

True if the given parameter can be associated (is parametrizable); False otherwise.

# Remarks

Only properties defined as parametrizable can be associated with global parameters. That excludes any read-only and formula-driven parameters, as well as those that have other explicit or implicit restrictions imposed by Revit.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | This parameter does not exist in the document anymore. |

# See Also

Parameter Class

Autodesk.Revit.DB Namespace

#### StairsAttrEqResult Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Calculation Rules"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsAttrEqResult { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsAttrEqResult As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsAttrEqResult { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### FamilyWorkPlaneBased Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Work Plane-Based"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FamilyWorkPlaneBased { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FamilyWorkPlaneBased As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FamilyWorkPlaneBased { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| TableSectionData Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

TableSectionData Class

Autodesk.Revit.DB Namespace

#### TranslationIn Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Translation in"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId TranslationIn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TranslationIn As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ TranslationIn { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### UseHeatingCredits Property

---

|  |
| --- |
| EnergyDataSettings Class   See Also |

If true, Revit will use heating credits in the final load sum calculations. If false, Revit will ignore heating credits in the final load sum calculations.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public bool UseHeatingCredits { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property UseHeatingCredits As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool UseHeatingCredits { 	bool get (); 	void set (bool value); } ``` |

# See Also

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace

#### HasOpenConnector Method

---

|  |
| --- |
| PlumbingUtils Class   See Also |

Checks if there is open piping connector for the given element - object of pipe curve, pipe fitting or pipe accessory.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static bool HasOpenConnector( 	Document document, 	ElementId elemId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function HasOpenConnector ( _ 	document As Document, _ 	elemId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool HasOpenConnector( 	Document^ document,  	ElementId^ elemId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

elemId
:   Type:  Autodesk.Revit.DB ElementId
     Element id to check.

#### Return Value

True if given element has open piping connector, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PlumbingUtils Class

Autodesk.Revit.DB.Plumbing Namespace

#### GetUnitTypeId Method

---

|  |
| --- |
| Parameter Class   See Also |

Gets the identifier of the unit quantifying the parameter value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public ForgeTypeId GetUnitTypeId() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetUnitTypeId As ForgeTypeId ``` |

| Visual C++ |
| --- |
| ``` public: ForgeTypeId^ GetUnitTypeId() ``` |

#### Return Value

Identifier of the unit of the parameter.

# Remarks

The property only applies to parameters of value types.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown if this parameter is not of value type. |

# See Also

Parameter Class

Autodesk.Revit.DB Namespace

#### CantileverHeight Property

---

|  |
| --- |
| StructuralSectionConcreteT Class   See Also |

Flange cantilever thickness.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public double CantileverHeight { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CantileverHeight As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double CantileverHeight { 	double get (); 	void set (double value); } ``` |

# See Also

StructuralSectionConcreteT Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### CutBackgroundPatternId Property

---

|  |
| --- |
| OverrideGraphicSettings Class   See Also |

The ElementId of the cut face background fill pattern override. A value of InvalidElementId means no override is set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public ElementId CutBackgroundPatternId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property CutBackgroundPatternId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ CutBackgroundPatternId { 	ElementId^ get (); } ``` |

# See Also

OverrideGraphicSettings Class

Autodesk.Revit.DB Namespace

#### RbsStartOffsetParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Start Middle Elevation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsStartOffsetParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsStartOffsetParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsStartOffsetParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RbsCurveHorOffsetParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Horizontal Justification"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsCurveHorOffsetParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsCurveHorOffsetParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsCurveHorOffsetParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetSizeInShortInts Method

---

|  |
| --- |
| IndexLine Class   See Also |

Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static int GetSizeInShortInts() ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetSizeInShortInts As Integer ``` |

| Visual C++ |
| --- |
| ``` public: static int GetSizeInShortInts() ``` |

#### Return Value

The number of short integers occupied by the primitive.

# See Also

IndexLine Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### IsKeySchedule Property

---

|  |
| --- |
| ScheduleDefinition Class   See Also |

Indicates if the schedule is a key schedule.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool IsKeySchedule { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsKeySchedule As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsKeySchedule { 	bool get (); } ``` |

# Remarks

A key schedule displays abstract "key" elements that can be used to populate parameters of ordinary model elements.

# See Also

ScheduleDefinition Class

Autodesk.Revit.DB Namespace

#### IsMonitoringLinkElement Method

---

|  |
| --- |
| Element Class   See Also |

Indicate whether an element is monitoring any elements in any linked models.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public bool IsMonitoringLinkElement() ``` |

| Visual Basic |
| --- |
| ``` Public Function IsMonitoringLinkElement As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsMonitoringLinkElement() ``` |

#### Return Value

True if this element is monitoring elements in a linked models. Otherwise, false will be returned.

# See Also

Element Class

Autodesk.Revit.DB Namespace

#### AnalyticConstructionGbxmlTypeid Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Construction Type Id"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AnalyticConstructionGbxmlTypeid { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AnalyticConstructionGbxmlTypeid As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AnalyticConstructionGbxmlTypeid { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GradientNoiseHigh Property

---

|  |
| --- |
| Gradient Class   See Also |

The property labeled "High" from the "Gradient" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string GradientNoiseHigh { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GradientNoiseHigh As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ GradientNoiseHigh { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble" within the range of "0, 1".

# See Also

Gradient Class

Autodesk.Revit.DB.Visual Namespace

#### RbsSegmentDescriptionParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Segment Description"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsSegmentDescriptionParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsSegmentDescriptionParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsSegmentDescriptionParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetRenderingAsset Method

---

|  |
| --- |
| AppearanceAssetElement Class   See Also |

Gets the rendering asset for the appearance asset element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public Asset GetRenderingAsset() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetRenderingAsset As Asset ``` |

| Visual C++ |
| --- |
| ``` public: Asset^ GetRenderingAsset() ``` |

#### Return Value

The rendering asset held by this appearance asset element.

# Remarks

The retrieved Asset may be empty if it is loaded from material library without any modification. In this case, you can use Application.GetAssets(AssetType.Appearance) to load all preset appearance assets, and retrieve the asset by its name.

# See Also

AppearanceAssetElement Class

Autodesk.Revit.DB Namespace

#### STLExportOptions Constructor (STLExportResolution)

---

|  |
| --- |
| STLExportOptions Class   See Also |

Constructs a new instance of STLExportOptions with all predefined tessellation settings, depending on STL export resolution type. Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2021.1

# Syntax

| C# |
| --- |
| ``` [ObsoleteAttribute("This constructor is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use another constructor with ExportResolution type of the input parameter instead.")] public STLExportOptions( 	STLExportResolution resolutionType ) ``` |

| Visual Basic |
| --- |
| ``` <ObsoleteAttribute("This constructor is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use another constructor with ExportResolution type of the input parameter instead.")> _ Public Sub New ( _ 	resolutionType As STLExportResolution _ ) ``` |

| Visual C++ |
| --- |
| ``` [ObsoleteAttribute(L"This constructor is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use another constructor with ExportResolution type of the input parameter instead.")] public: STLExportOptions( 	STLExportResolution resolutionType ) ``` |

#### Parameters

resolutionType
:   Type:  Autodesk.Revit.DB STLExportResolution
     The type of STL export resolution.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

STLExportOptions Class

STLExportOptions Overload

Autodesk.Revit.DB Namespace

#### GetStatus Method

---

|  |
| --- |
| Transaction Class   See Also |

Returns the current status of the transaction.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public TransactionStatus GetStatus() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetStatus As TransactionStatus ``` |

| Visual C++ |
| --- |
| ``` public: TransactionStatus GetStatus() ``` |

#### Return Value

The current status of the transaction.

# Remarks

If the status was set to TransactionStatus.Pending as the result of calling Commit or RollBack, the status will be changed later to either 'Committed' or 'RolledBack' after failure handling is finished. That status change will be made asynchronously.

# See Also

Transaction Class

Autodesk.Revit.DB Namespace

#### PlacementLevelId Property

---

|  |
| --- |
| NumberSystem Class   See Also |

The id of the base level of stairs on which the NumberSystem is placed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public LinkElementId PlacementLevelId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property PlacementLevelId As LinkElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property LinkElementId^ PlacementLevelId { 	LinkElementId^ get (); } ``` |

# Remarks

In multistory stairs, a stairs element could be a stair group or individual stair, this level could be the base level of group member or stairs element.

# See Also

NumberSystem Class

Autodesk.Revit.DB Namespace

#### PointElevation Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Elevation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PointElevation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PointElevation As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PointElevation { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsAttached Property

---

|  |
| --- |
| Group Class   See Also |

Indicates wether or not this group is attached to a parent group.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2019.1

# Syntax

| C# |
| --- |
| ``` public bool IsAttached { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsAttached As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsAttached { 	bool get (); } ``` |

# See Also

Group Class

Autodesk.Revit.DB Namespace